Repository: Xubuntu/xubuntu-docs
Catalog: contributor-docs/po/*.po
Languages: id

source: The council is expected to take action or respond to any issue raised within 2 weeks. If appropriate and fair, the first action can be postponement.
id: Dewan diharapkan untuk mengambil tindakan atau menanggapi masalah apa pun yang diangkat dalam waktu 2 minggu. Jika sesuai dan adil, tindakan pertama dapat ditunda.

source: If at any time a majority of the Xubuntu team considers the actions of the council harmful for the project, the issue at hand should be raised to the council for reconsideration. If a resolution can't be found, the council should consult the the Ubuntu Community Council and other appropriate Ubuntu community teams. Similarly, if the council can't reach a consensus even after consulting the Xubuntu team, they should consult the Ubuntu Community Council and other appropriate Ubuntu community teams.
id: Jika suatu saat mayoritas tim Xubuntu menganggap tindakan dewan berbahaya bagi proyek, masalah yang ada harus diangkat ke dewan untuk dipertimbangkan kembali. Jika resolusi tidak dapat ditemukan, dewan harus berkonsultasi dengan Dewan Komunitas Ubuntu dan tim komunitas Ubuntu lainnya yang sesuai. Demikian pula, jika dewan tidak dapat mencapai konsensus bahkan setelah berkonsultasi dengan tim Xubuntu, mereka harus berkonsultasi dengan Dewan Komunitas Ubuntu dan tim komunitas Ubuntu lainnya yang sesuai.

source: Xubuntu Team
id: Tim Xubuntu

source: The Xubuntu team is a group of individuals who are primarily responsible for the Xubuntu development.
id: Tim Xubuntu adalah sekelompok individu yang terutama bertanggung jawab untuk pengembangan Xubuntu.

source: The Xubuntu team is organized in Launchpad as <ulink url="https://launchpad.net/~xubuntu-team">xubuntu-team</ulink>. The Launchpad team is moderated.
id: Tim Xubuntu diatur dalam Launchpad sebagai <ulink url = "https://launchpad.net/~xubuntu-team"> xubuntu-team </ulink>. Tim Launchpad dimoderasi.

source: The individuals wanting to join the Xubuntu team are required to meet the criteria described below prior to applying or they will be automatically declined. Leaders for subteams can be appointed from this team. The Xubuntu team is moderated by the council.
id: Individu yang ingin bergabung dengan tim Xubuntu diharuskan untuk memenuhi kriteria yang diminta di bawah sebelum mendaftar atau mereka akan disetujui secara otomatis. Pemimpin untuk sub-tim dapat ditunjuk dari tim ini. Tim Xubuntu dimoderatori oleh dewan.

source: In case a team lead is in the minority when voting on an issue that concerns their area of expertise, the team lead should be given another hearing, after which the team should take extra care in deciding about the issue and may want to consider voting on it again after more discussion. If required, the issue can be raised to the council for further consideration.
id: Dalam hal seorang pemimpin tim berada dalam minoritas ketika memberikan suara pada suatu masalah yang menyangkut bidang keahlian mereka, pemimpin tim harus diberi sidang lagi, setelah itu tim harus lebih berhati-hati dalam memutuskan tentang masalah ini dan mungkin ingin mempertimbangkan memilih pada lagi setelah diskusi lebih lanjut. Jika diperlukan, masalah ini dapat diangkat ke dewan untuk dipertimbangkan lebih lanjut.

source: Becoming and staying a member
id: Menjadi dan tetap menjadi anggota

source: To be accepted to the Xubuntu team, applicants participants must demonstrate their motivation and ability to contribute to Xubuntu. This is to ensure that any Xubuntu team member has a sufficient understanding of the Xubuntu community and its operation. The different steps one must go through will also indicate that the candidate member is able to work within the guidelines, and more important, with other people and communities. To become a member, one must:
id: Untuk diterima di tim Xubuntu, peserta pelamar harus menunjukkan motivasi dan kemampuan mereka untuk berkontribusi ke Xubuntu. Ini untuk memastikan bahwa setiap anggota tim Xubuntu memiliki pemahaman yang cukup tentang komunitas Xubuntu dan operasinya. Langkah-langkah berbeda yang harus dilalui juga akan menunjukkan bahwa calon anggota dapat bekerja dalam pedoman, dan yang lebih penting, dengan orang lain dan masyarakat. Untuk menjadi anggota, seseorang harus:

source: Commit meaningful contributions to one of the subteams, after which one can be approved to the subteam for "probation" by a subteam administrator
id: Komit kontribusi yang berarti kepada salah satu sub tim, setelah itu seseorang dapat ditunjuk ke subteam untuk "masa percobaan" oleh administrator subteam

source: Demonstrate motivation to contribute perpetually, after which one can be approved to the Xubuntu team
id: Tunjukkan motivasi untuk berkontribusi terus-menerus, setelah itu seseorang dapat disetujui untuk tim Xubuntu

source: To stay a member of the Xubuntu team, the member will have to have desire to continue contributing in the future. Anyone with no contributions for more than a complete cycle (6 months) should deactivate themself from the team as well as all subteams and reapply if/when they are willing to rejoin. The team administrators should purge people with no contributions in more than 6 months from the teams occasionally.
id: Untuk tetap menjadi anggota tim Xubuntu, anggota harus memiliki keinginan untuk terus berkontribusi di masa depan. Siapa pun yang tidak memiliki kontribusi selama lebih dari satu siklus lengkap (6 bulan) harus menonaktifkan diri mereka sendiri dari tim dan juga semua subteam dan mengajukan permohonan kembali jika / ketika mereka mau bergabung kembali. Administrator tim harus membersihkan orang-orang yang tidak memiliki kontribusi lebih dari 6 bulan dari tim sesekali.

source: Xubuntu Users
id: Pengguna Xubuntu

source: The Launchpad team <ulink url="https://launchpad.net/~xubuntu-users">xubuntu-users</ulink> is the formal top-level group of people who are interested in Xubuntu. The team is open for anybody to join.
id: Tim Launchpad <ulink url = "https://launchpad.net/~xubuntu-users"> xubuntu-users </ulink> adalah grup resmi orang-orang tingkat atas yang tertarik pada Xubuntu. Tim terbuka bagi siapa saja untuk bergabung.

source: The members of the official Launchpad group are encouraged to give user support on IRC and on the Xubuntu users mailing list as well as spread the word about Xubuntu anywhere they see fit, including but not limited to blogs, social media and conferences.
id: Anggota kelompok Launchpad resmi didorong untuk memberikan dukungan pengguna pada IRC dan pada milis pengguna Xubuntu serta menyebarkan berita tentang Xubuntu di mana saja yang mereka inginkan, termasuk tetapi tidak terbatas pada blog, media sosial, dan konferensi.

source: In addition to user support and advocacy, the members are free to organize as they like on social media platforms and more. If the group is considered substantial and useful enough, the Xubuntu team can name it official and help with maintaining it. All currently official teams and their administrators are listed on the Xubuntu wiki under the <ulink url="http://wiki.xubuntu.org/website/admins">Website Administrators</ulink> page.
id: Selain dukungan dan advokasi pengguna, para anggota bebas untuk mengatur sesuka mereka di platform media sosial dan banyak lagi. Jika grup dianggap cukup besar dan bermanfaat, tim Xubuntu dapat menyebutkannya resmi dan membantu mempertahankannya. Semua tim yang saat ini resmi dan administratornya terdaftar di wiki Xubuntu di bawah <ulink url = "http://wiki.xubuntu.org/website/admins"> halaman Administrator Situs Web </ulink>.

source: Development
id: Pengembangan

source: Coordination
id: Koordinasi

source: The direction of the development of the project is coordinated by:
id: Arah pengembangan proyek dikoordinasikan oleh:

source: The Strategy Document
id: Dokumen Strategi

source: Release-specific blueprints and specifications
id: Cetak biru spesifik dan spesifikasi

source: The community meetings
id: Pertemuan komunitas

source: The developer communication tools listed below
id: Alat komunikasi pengembang tercantum di bawah ini

source: Communication
id: Komunikasi

source: For Xubuntu to be successful, its members and community must have the right tools to enable useful and helpful communication and ultimately, to help the community grow. These communication tools include the following "core" tools:
id: Agar Xubuntu berhasil, anggota dan komunitasnya harus memiliki alat yang tepat untuk memungkinkan komunikasi yang bermanfaat dan bermanfaat dan pada akhirnya, untuk membantu komunitas tumbuh. Alat komunikasi ini meliputi alat "inti" berikut:

source: <emphasis>Mailing lists</emphasis>; Xubuntu-users for community support and user discussions and the Xubuntu-devel list for development discussion and coordination
id: <emphasis> Milis </emphasis>; Pengguna Xubuntu untuk dukungan komunitas dan diskusi pengguna dan daftar devel Xubuntu untuk diskusi dan koordinasi pengembangan

source: <emphasis>IRC channels</emphasis>; #xubuntu for community support, #xubuntu-devel for development discussion and coordination and #xubuntu-offtopic for general discussion with a more relaxed mood
id: <emphasis> saluran IRC </emphasis>; #xubuntu untuk dukungan komunitas, #xubuntu-devel untuk diskusi dan koordinasi pengembangan dan #xubuntu-offtopic untuk diskusi umum dengan suasana hati yang lebih santai

source: <emphasis>Launchpad</emphasis> for team organization and granting permissions and access rights via team memberships
id: <emphasis> Launchpad </emphasis> untuk organisasi tim dan pemberian izin dan hak akses melalui keanggotaan tim

source: <emphasis>The Xubuntu website</emphasis> for news, development articles and general information about Xubuntu
id: <emphasis> Situs web Xubuntu </emphasis> untuk berita, artikel pengembangan, dan informasi umum tentang Xubuntu

source: <emphasis>The Xubuntu developer area</emphasis> for tracking development progress and collaborating on development issues and sharing development related information on the wiki
id: <emphasis> Area pengembang Xubuntu </emphasis> untuk melacak kemajuan pengembangan dan berkolaborasi dalam masalah pengembangan dan berbagi informasi terkait pengembangan di wiki

source: In addition to communicating with each other and the Xubuntu community, the Xubuntu team should communicate continuosly with other Ubuntu contributors, upstream and other projects related to Xubuntu. The team members should take part in the development discussion outside Xubuntu as well to create and maintain healthy relationships with other projects and their developers.
id: Selain berkomunikasi satu sama lain dan komunitas Xubuntu, tim Xubuntu harus berkomunikasi terus menerus dengan kontributor Ubuntu lainnya, proyek upstream dan lainnya yang terkait dengan Xubuntu. Anggota tim harus mengambil bagian dalam diskusi pengembangan di luar Xubuntu juga untuk menciptakan dan memelihara hubungan yang sehat dengan proyek lain dan pengembang mereka.

source: Dispute Resolution
id: Penyelesaian sengketa

source: The Code Of Conduct (CoC) is one of the most fundamental documents in the Ubuntu community, including Xubuntu, and it functions as the base for a working community. Everybody and every communicating medium in the Xubuntu community is CoC-compliant at all times.
id: Code Of Conduct (CoC) adalah salah satu dokumen paling mendasar dalam komunitas Ubuntu, termasuk Xubuntu, dan berfungsi sebagai basis untuk komunitas yang bekerja. Semua orang dan setiap media komunikasi di komunitas Xubuntu selalu mematuhi CoC.

source: To read the most recent revision of the Ubuntu Code of Conduct, refer to the <ulink url="http://www.ubuntu.com/about/about-ubuntu/conduct">Ubuntu Code of Conduct</ulink> page on the Ubuntu website.
id: Untuk membaca revisi terbaru dari Kode Etik Ubuntu, lihat halaman <ulink url = "http://www.ubuntu.com/about/about-ubuntu/conduct"> halaman Code of Conduct Ubuntu </ulink> di situs web Ubuntu.

source: When disputes occur, contributors are strongly encouraged to refrain from taking the disputed actions to avoid sabotaging the dispute resolution process.
id: Ketika perselisihan terjadi, kontributor sangat dianjurkan untuk menahan diri dari mengambil tindakan yang disengketakan untuk menghindari menyabot proses penyelesaian perselisihan.

source: Release and Support Cycles
id: Rilis dan Siklus Dukungan

source: The Xubuntu release cycle consists of 6 months from start to release, then an additional 9 month of maintenance for standard releases and 3 years of support for LTS releases. Although the Xubuntu project itself can not provide commercial support or commercial guarantees, the Xubuntu team will make every effort to conform with the acknowledged support period and provide security updates for Xubuntu packages.
id: Siklus rilis Xubuntu terdiri dari 6 bulan dari awal hingga rilis, kemudian 9 bulan tambahan pemeliharaan untuk rilis standar dan 3 tahun dukungan untuk rilis LTS. Meskipun proyek Xubuntu sendiri tidak dapat memberikan dukungan komersial atau jaminan komersial, tim Xubuntu akan melakukan segala upaya untuk menyesuaikan dengan periode dukungan yang diakui dan memberikan pembaruan keamanan untuk paket Xubuntu.

source: For more information about the specifics of the processes related to developing a release, see <xref linkend="processes"/>.
id: Untuk informasi lebih lanjut tentang spesifikasi proses yang terkait dengan pengembangan rilis, lihat <xref linkend ="proses"/>.

source: Seeds and Composition
id: Asal dan Komposisi

source: Core Components
id: Komponen Inti

source: The following packages and their technical dependencies are considered essential in composing an operating system that represents the goals set previously in this document:
id: Paket-paket berikut dan ketergantungan teknisnya dianggap penting dalam menyusun sistem operasi yang mewakili tujuan yang ditetapkan sebelumnya dalam dokumen ini:

source: xfwm4 (Xfce4 window manager)
id: xfwm4 (manajer jendela Xfce4)

source: xfce4-panel (Xfce4 panel)
id: xfce4-panel (panel Xfce4)

source: xfce4-session (Xfce4 session manager)
id: xfce4-session (manajer sesi Xfce4)

source: xfconf (Xfce4 configuration storage system)
id: xfconf (sistem penyimpanan konfigurasi Xfce4)

source: xfce4-settings (Xfce4 settings manager)
id: xfce4-settings (manajer pengaturan Xfce4)

source: thunar (file manager)
id: thunar (pengelola berkas)

source: Unless the components mentioned above are deprecated and no longer work as they are intended, they should not be substituted or removed from the seed.
id: Kecuali komponen-komponen yang disebutkan di atas sudah tidak digunakan lagi dan tidak lagi berfungsi sebagaimana mestinya, komponen-komponen tersebut tidak boleh diganti atau dikeluarkan dari asalnya.

source: The <literal><placeholder-1/>xubuntu-core</literal> metapackage consists of the core packages as well as other important packages which contribute to the Xubuntu experience. The <literal><placeholder-2/>xubuntu-desktop</literal> metapackage depends on the core metapackage and includes additional packages to provide the full, ready to use, Xubuntu experience.
id: Metapackage <literal> <placeholder-1 /> xubuntu-core </literal> terdiri dari paket-paket inti dan juga paket-paket penting lainnya yang berkontribusi pada pengalaman Xubuntu. Metapackage <literal> <placeholder-2 /> xubuntu-desktop </literal> tergantung pada metapackage inti dan termasuk paket tambahan untuk memberikan pengalaman Xubuntu yang lengkap, siap digunakan,.

source: Package Selection
id: Pilihan Paket

source: When considering the package selection for Xubuntu, there are two main guidelines:
id: Saat mempertimbangkan pemilihan paket untuk Xubuntu, ada dua pedoman utama:

source: The package must be in line with the mission statement
id: Paket harus sesuai dengan pernyataan misi

source: The package selection process must be conducted as objectively as possible
id: Proses pemilihan paket harus dilakukan seobjektif mungkin

source: While the Xubuntu Technical Lead has the last word on package selection with the approval of the Xubuntu Council, it's recommended that the whole team is involved in the discussion, bringing up well thought out arguments both for and against. When appropriate, tests should be conducted to gather meaningful measurements.
id: Sementara Pimpinan Teknis Xubuntu memiliki kata terakhir dalam pemilihan paket dengan persetujuan Dewan Xubuntu, direkomendasikan bahwa seluruh tim terlibat dalam diskusi, mengemukakan argumen yang dipikirkan baik untuk maupun melawan. Bila perlu, tes harus dilakukan untuk mengumpulkan pengukuran yang bermakna.

source: Before seeding an application in Xubuntu, the following aspects should be considered:
id: Sebelum memasang aplikasi di Xubuntu, aspek-aspek berikut harus dipertimbangkan:

source: Usability and integration
id: Kegunaan dan integrasi

source: Usefulness
id: Kegunaan

source: Resource consumption and size
id: Konsumsi dan ukuran sumber daya

source: Reliability
id: Kehandalan

source: Localization
id: Lokalisasi

source: When measuring if a package is right for Xubuntu, the decision should not be based on an analysis of the package alone, but the target package along with its dependencies. Any package that is considered for seeding should fulfill the following requirements:
id: Ketika mengukur apakah suatu paket tepat untuk Xubuntu, keputusan tidak boleh didasarkan pada analisis paket saja, tetapi paket target beserta ketergantungannya. Paket apa pun yang dipertimbangkan untuk pembenihan harus memenuhi persyaratan berikut:

source: The package should use the GTK toolkit
id: Paket harus menggunakan toolkit GTK

source: The package should not pull in heavy libraries, especially if they will run and/or start frequently
id: Paket tidak boleh menarik banyak perpustakaan, terutama jika mereka akan dan / atau mulai sering dijalankan

source: The package should be well maintained upstream
id: Paket harus dipelihara dengan baik di hulu

source: The above guidelines can be omitted with the approval of the council when there are extensive benefits to seeding the package.
id: Pedoman di atas dapat dihilangkan dengan persetujuan dewan ketika ada banyak manfaat untuk penyemaian paket.

source: Quality Assurance (QA)
id: Jaminan Kualitas (QA)

source: There are various QA trackers, wiki and Launchpad pages, the links to which can be found on <xref linkend="qa-team-links"/>.
id: Ada berbagai pelacak QA, halaman wiki dan Launchpad, tautan yang dapat ditemukan di <xref linkend="qa-team-links"/>.

source: The Xubuntu QA team was formed to ensure that the quality of a released Xubuntu conforms to the parameters laid out in the Xubuntu Processes documents. In order to successfully accomplish this, close team working relationships, especially with the development team and the Xubuntu Council are paramount. Xubuntu's success is based on close working amongst all of its various teams.
id: Tim QA Xubuntu dibentuk untuk memastikan bahwa kualitas Xubuntu yang dirilis sesuai dengan parameter yang ditetapkan dalam dokumen Proses Xubuntu. Agar berhasil mencapai hal ini, hubungan kerja tim yang dekat, terutama dengan tim pengembangan dan Dewan Xubuntu adalah yang terpenting. Keberhasilan Xubuntu didasarkan pada kerja yang erat di antara semua timnya yang beragam.

source: In addition, the team gives people contributing through testing of Xubuntu the opportunity to become part of the <ulink url="https://launchpad.net/~xubuntu-team">Xubuntu Team</ulink>. For that to be of practical use, the QA team should keep an eye on testing reports on the trackers and propose users they have seen taking a keen interest in the work of the QA team.
id: Selain itu, tim memberi orang-orang yang berkontribusi melalui pengujian Xubuntu kesempatan untuk menjadi bagian dari <ulink url="https://launchpad.net/~xubuntu-team">Tim Xubuntu</ulink>. Untuk itu agar praktis digunakan, tim QA harus mengawasi laporan pengujian pada pelacak dan mengusulkan pengguna yang mereka lihat tertarik pada pekerjaan tim QA.

source: Excluding testing itself, control of the testcases that we use for ISO and Package testing, along with communicating the testing requirements for any particular development cycle (hereafter cycle) to the community, makes up the bulk of the teams work in any given cycle.
id: Tidak termasuk pengujian itu sendiri, kontrol terhadap testcases yang kami gunakan untuk pengujian ISO dan Paket, bersama dengan mengkomunikasikan persyaratan pengujian untuk setiap siklus pengembangan tertentu (siklus selanjutnya) ke masyarakat, merupakan bagian terbesar dari tim yang bekerja dalam siklus tertentu.

source: Members of the QA team should check the current Xubuntu QA blueprint, and assign themselves to tasks they feel able to undertake.
id: Anggota tim QA harus memeriksa cetak biru Xubuntu QA saat ini, dan menugaskan diri mereka untuk tugas-tugas yang mereka rasa mampu mereka lakukan.

source: Testing
id: Pengujian

source: At the start of a cycle, the Release Team will discuss which ISO Testing Weeks we will participate in. Then, during a Community Meeting, members of Xubuntu Team will discuss and then ratify Xubuntu's participation during the cycle.
id: Pada awal siklus, Tim Rilis akan membahas minggu Pengujian ISO mana yang akan kami ikuti. Kemudian, selama Pertemuan Komunitas, anggota Tim Xubuntu akan membahas dan kemudian meratifikasi partisipasi Xubuntu selama siklus.

source: Along with general testing of our OS, dealt with further in <xref linkend="qa-testing-exploratory"/> and <xref linkend="qa-testing-ppa"/>, further responsibilities lie with ensuring that:
id: Seiring dengan pengujian umum OS kami, ditangani lebih lanjut dalam <xref linkend="qa-testing-exploratory"/> dan <xref linkend="qa-testing-ppa"/>, tanggung jawab lebih lanjut terletak dengan memastikan bahwa:

source: Sufficient testing takes place during ISO Testing Weeks
id: Pengujian yang memadai berlangsung selama Minggu Pengujian ISO

source: Sufficient package testing takes place following calls to testers
id: Pengujian paket yang memadai terjadi setelah panggilan ke penguji

source: Sufficient testing has taken place by Final Release
id: Pengujian yang memadai telah dilakukan oleh Final Release

source: Bugs reported to our trackers are confirmed, or where unable to confirm, further information is requested from the reporter
id: Bug yang dilaporkan kepada pelacak kami dikonfirmasi, atau jika tidak dapat dikonfirmasi, informasi lebih lanjut diminta dari pelapor

source: Where appropriate, confirmation of bugs can be asked of members of Xubuntu Team in the team devel IRC channel
id: Apabila diperlukan, konfirmasi bug dapat ditanyakan kepada anggota Tim Xubuntu di saluran IRC tim devel

source: Members of the QA team might find it useful subscribing to the <ulink url="https://launchpad.net/~xubuntu-bugs">Xubuntu Bugs</ulink> team in order to be aware of bugs being reported by users.
id: Anggota tim QA mungkin merasa perlu berlangganan <ulink url="https://launchpad.net/~xubuntu-bugs"> tim Xubuntu Bugs</ulink> untuk mengetahui bug yang dilaporkan oleh pengguna.

source: Working with trackers
id: Bekerja dengan pelacak

source: The initial decisions on what and when to test, will be taken following discussion with the members of the <ulink url="https://launchpad.net/~xubuntu-release">Xubuntu Release</ulink> team.
id: Keputusan awal tentang apa dan kapan menguji, akan diambil setelah diskusi dengan anggota <ulink url="https://launchpad.net/~xubuntu-release"> tim Xubuntu Release</ulink>.

source: At the start of a cycle, the QA team needs to ensure that:
id: Pada awal siklus, tim QA perlu memastikan bahwa:

source: Image testcases we use are still correct.
id: Kasus uji gambar yang kami gunakan masih benar.
