Repository: Xubuntu/xubuntu-docs
Catalog: contributor-docs/po/*.po
Languages: id

source: Translator data could not be acquired, please see <ulink url="https://translations.launchpad.net/xubuntu-docs">Launchpad</ulink>.
id: Data penerjemah tidak bisa diperoleh, silahkan lihat <ulink url="https://translations.launchpad.net/xubuntu-docs">Launchpad</ulink>.

source: The contributors to this translation of the documentation are:
id: Para kontributor untuk penterjemahan dari dokumentasi ini adalah :

source: Would you rather read this documentation in PDF?
id: Apakah Anda bersedia membaca dokumentasi ini dalam bentuk PDF?

source: Select your preferred paper size: <ulink url="xubuntu-documentation-A4.pdf">A4</ulink> or <ulink url="xubuntu-documentation-USletter.pdf">US letter</ulink>.
id: Pilih ukuran kertas pilihan Anda: <ulink url = "xubuntu-dokumentasi-A4.pdf"> A4 </ulink> atau <ulink url = "xubuntu-dokumentasi-USletter.pdf"> US letter </ulink>.

source: Website
id: Situs web

source: Introduction to the Xubuntu web presence
id: Pengantar kedatangan web Xubuntu

source: <emphasis>The website is the main output for end-users.</emphasis> The content on the website should be easily understandable and approachable.
id: <emphasis> Situs web adalah output utama bagi pengguna akhir. </emphasis> Konten di situs web harus mudah dimengerti dan didekati.

source: The website is a WordPress instance on a server maintained by the Canonical IS. The website content is overseen and administrated by the Xubuntu website team. The website team can submit tickets to the Canonical IS for any problems. Bugs that are related to the website can be submitted on Launchpad, under the <ulink url="https://bugs.launchpad.net/xubuntu-website/+bugs">bugs for xubuntu-website</ulink>.
id: Situs web ini adalah turunan WordPress di server yang dikelola oleh Canonical IS. Konten situs web diawasi dan dikelola oleh tim situs web Xubuntu. Tim situs web dapat mengirimkan tiket ke IS Canonical untuk masalah apa pun. Bug yang terkait dengan situs web dapat dikirimkan di Launchpad, di bawah <ulink url = "https://bugs.launchpad.net/xubuntu-website/+bugs"> bug untuk xubuntu-situs web </ulink>.

source: The source code for the website is available at <literal><placeholder-1/>lp:xubuntu-website</literal> (the theme) and <literal><placeholder-2/>lp:xubuntu-website/plugins</literal> (the plugins).
id: Kode sumber untuk situs web tersedia di <literal> <placeholder-1 /> lp: xubuntu-website </literal> (tema) dan <literal> <placeholder-2 /> lp: xubuntu-website / plugins </ literal> (plugin).

source: Xubuntu wiki
id: Wiki Xubuntu

source: The Xubuntu wiki is used for some developer communication and serves as an archive for older release roadmaps and specification.
id: Wiki Xubuntu digunakan untuk beberapa komunikasi pengembang dan berfungsi sebagai arsip untuk peta jalan dan spesifikasi rilis yang lebih lama.

source: Xubuntu website maintenance documentation
id: Dokumentasi pemeliharaan situs web Xubuntu

source: Releases
id: Rilis

source: The Xubuntu website tracks releases with a custom WordPress taxonomy. The release terms can be attached to virtually any content type used on the website. The release term information and attached content are used to automatize some content creation on the website, including but not necessarily limited to: the <ulink url="https://xubuntu.org/releases">release pages</ulink>, the <ulink url="https://xubuntu.org/getxubuntu/">Download page</ulink>, the <ulink url="https://xubuntu.org/help/">Help &amp; Support</ulink> page and the <ulink url="https://xubuntu.org/press/">In the Press</ulink> page.
id: Situs web Xubuntu melacak rilis dengan taksonomi WordPress khusus. Ketentuan rilis dapat dilampirkan ke hampir semua jenis konten yang digunakan di situs web. Informasi istilah rilis dan konten terlampir digunakan untuk mengotomatisasi beberapa pembuatan konten di situs web, termasuk tetapi tidak terbatas pada: <ulink url = "https://xubuntu.org/releases"> halaman rilis </ulink>, <ulink url = "https://xubuntu.org/getxubuntu/"> Laman unduhan </ulink>, <ulink url = "https://xubuntu.org/help/"> Bantuan & amp; Dukung halaman </ulink> dan <ulink url = "https://xubuntu.org/press/"> Di halaman Pers </ulink>.

source: To edit the generic information for each release (codename, release date, EOL date, links for Torrent downloads and online documentation and release switch), go to <ulink url="https://xubuntu.org/wp-admin/edit-tags.php?taxonomy=release">Posts – Releases</ulink>.
id: Untuk mengedit informasi umum untuk setiap rilis (nama kode, tanggal rilis, tanggal EOL, tautan untuk unduhan Torrent dan dokumentasi daring dan sakelar rilis), buka <ulink url = "https://xubuntu.org/wp-admin/edit- tags.php? taxonomy = release "> Posting - Rilis </ulink>.

source: To attach any content to a release, select the desired release(s) on the content edit page.
id: Untuk melampirkan konten apa pun ke rilis, pilih rilis yang diinginkan pada halaman edit konten.

source: The following shortcodes are used to output aggregated release information (replace <literal>xx-xx</literal> with the desired release slug):
id: Shortcode berikut digunakan untuk menampilkan informasi rilis teragregasi (ganti <literal> xx-xx </literal> dengan slug rilis yang diinginkan):

source: <userinput>[torrents release=xx-xx]</userinput> to output Torrent download links
id: <userinput> [torrents release = xx-xx] </userinput> untuk menghasilkan tautan unduhan Torrent

source: <userinput>[mirrors release=xx-xx]</userinput> to output the mirror download link list with extended information available
id: <userinput> [mirror release = xx-xx] </userinput> untuk menampilkan daftar tautan unduhan cermin dengan informasi tambahan yang tersedia

source: <userinput>[press release=xx-xx]</userinput> to output all press links attached to the release and <userinput>[press]</userinput> to output the press archive
id: <userinput> [press release = xx-xx] </userinput> untuk menampilkan semua tautan pers yang dilampirkan ke rilis dan <userinput> [tekan] </userinput> untuk menampilkan arsip pers

source: <userinput>[documentation_links]</userinput> to output a list with links to the online documentation for all released and supported releases
id: <userinput> [dokumentasi_links] </userinput> untuk menampilkan daftar dengan tautan ke dokumentasi online untuk semua rilis yang dirilis dan didukung

source: The releases landing page uses the page template of the same name; the template lists all released and supported releases with their short descriptions. The release pages are created automatically.
id: Halaman arahan rilis menggunakan templat halaman dengan nama yang sama; templat mencantumkan semua yang dirilis dan didukung rilis dengan deskripsi singkatnya. Halaman rilis dibuat secara otomatis.

source: Release links
id: Rilis tautan

source: To add press links (and other official release-specific links apart from Torrent download links and links to online documentation), go to <ulink url="https://xubuntu.org/wp-admin/post-new.php?post_type=release_link">Release Links</ulink>. Once added to the database, links will appear in the appropriate places automatically.
id: Untuk menambahkan tautan pers (dan tautan khusus rilis resmi lainnya selain dari tautan unduhan Torrent dan tautan ke dokumentasi online), buka <ulink url = "https://xubuntu.org/wp-admin/post-new.php?post_type = release_link "> Rilis Tautan </ulink>. Setelah ditambahkan ke basis data, tautan akan muncul di tempat yang sesuai secara otomatis.

source: Download mirrors
id: Unduh mirror

source: The download link lists are created automatically from URL templates saved in the database. To manage release mirrors on the download lists, go to <ulink url="https://xubuntu.org/wp-admin/edit.php?post_type=download_mirror">DL Mirrors</ulink>. On the edit pages you are able to make download mirrors active or inactive (respectively visible and hidden on the frontend). You can also change which download links are shown on the default listing; set the mirror as a <emphasis>main download mirror</emphasis> if you want it to be visible directly.
id: Daftar tautan unduhan dibuat secara otomatis dari templat URL yang disimpan dalam database. Untuk mengelola rilis cermin pada daftar unduhan, buka <ulink url = "https://xubuntu.org/wp-admin/edit.php?post_type=download_mirror"> DL Mirrors </ulink>. Pada halaman edit Anda dapat membuat mirror unduhan aktif atau tidak aktif (masing-masing terlihat dan disembunyikan di frontend). Anda juga dapat mengubah tautan unduhan mana yang ditampilkan pada daftar default; atur mirror sebagai <emphasis> mirror unduhan utama </emphasis> jika Anda ingin itu dapat dilihat secara langsung.

source: Strategy Document
id: Dokumen Strategi

source: Introduction
id: Pengantar

source: About this Document
id: Tentang Dokumen ini

source: This document will describe the strategy, vision and direction of the Xubuntu project as well as act as a guide and a reference for the Xubuntu Team.
id: Dokumen ini akan menjelaskan strategi, visi, dan arah proyek Xubuntu serta bertindak sebagai panduan dan referensi untuk Tim Xubuntu.

source: This revised version has been written by Pasi Lallinaho with the help of Elizabeth Krumbach and Simon Steinbeiß along with numerous people in the community. This version is based on the former Xubuntu Strategy Document by Cody Somerville et al.
id: Versi revisi ini telah ditulis oleh Pasi Lallinaho dengan bantuan Elizabeth Krumbach dan Simon Steinbeiß bersama dengan banyak orang di komunitas. Versi ini didasarkan pada Dokumen Strategi Xubuntu sebelumnya oleh Cody Somerville et al.

source: We wish thank to Cody Somerville, Jono Bacon, Eero Tamminen, Nico Veenkamp and Lionel Le Folgoc for their contributions to this document. Some content, ideas, and inspiration were derived from existing Ubuntu documentation.
id: Kami mengucapkan terima kasih kepada Cody Somerville, Jono Bacon, Eero Tamminen, Nico Veenkamp, ​​dan Lionel Le Folgoc atas kontribusi mereka pada dokumen ini. Beberapa konten, ide, dan inspirasi berasal dari dokumentasi Ubuntu yang ada.

source: Mission Statement
id: Pernyataan Misi

source: Xubuntu is a community-developed, Ubuntu-based operating system that combines elegance and ease of use. Xubuntu provides a light, stable and configurable desktop environment with conservative workflows. Xubuntu delivers a polished and unified product ready for end-users.
id: Xubuntu adalah sistem operasi berbasis Ubuntu yang dikembangkan masyarakat yang menggabungkan keanggunan dan kemudahan penggunaan. Xubuntu menyediakan lingkungan desktop yang ringan, stabil dan dapat dikonfigurasi dengan alur kerja yang konservatif. Xubuntu menghadirkan produk yang dipoles dan terpadu yang siap untuk pengguna akhir.

source: In addition to the technical aspects, the Xubuntu team focuses on contributor and user communities.
id: Selain aspek teknis, tim Xubuntu berfokus pada komunitas kontributor dan pengguna.

source: The target audience for Xubuntu consists of users who are interested in having an elegant, easy to use, polished and unified operating system. Xubuntu is a good option for those who want a stable, configurable and/or relatively light desktop environment too. Finally, Xubuntu is an appealing choice for users who prefer conservative workflows over the newest innovations.
id: Target pengguna untuk Xubuntu terdiri dari pengguna yang tertarik untuk memiliki sistem operasi yang elegan, mudah digunakan, dipoles dan terpadu. Xubuntu adalah pilihan yang baik bagi mereka yang menginginkan lingkungan desktop yang stabil, dapat dikonfigurasi dan / atau relatif ringan juga. Akhirnya, Xubuntu adalah pilihan yang menarik bagi pengguna yang lebih menyukai alur kerja konservatif daripada inovasi terbaru.

source: Xubuntu does not target users with specific skill sets or aptitudes. We want Xubuntu to be a viable option for users who are new to Linux or the Ubuntu platform, but also be appealing to more experienced users. Xubuntu does not specifically focus on new users or users migrating from Windows, but according to this ease of use, it is a good alternative for those users as well.
id: Xubuntu tidak menargetkan pengguna dengan keahlian atau bakat tertentu. Kami ingin Xubuntu menjadi opsi yang layak untuk pengguna yang baru mengenal Linux atau platform Ubuntu, tetapi juga menarik bagi pengguna yang lebih berpengalaman. Xubuntu tidak secara khusus berfokus pada pengguna baru atau pengguna yang bermigrasi dari Windows, tetapi menurut kemudahan penggunaan ini, Xubuntu juga merupakan alternatif yang baik untuk pengguna tersebut.

source: Xubuntu does not explicitly target users with low, modest, or high powered machines but instead targets the entire spectrum. Xubuntu's extra responsiveness and speed, among other positive traits, can be appreciated by all users, regardless of their hardware.
id: Xubuntu tidak secara eksplisit menargetkan pengguna dengan mesin bertenaga rendah, sedang, atau tinggi tetapi malah menargetkan seluruh spektrum. Kecepatan dan respons ekstra Xubuntu, di antara sifat-sifat positif lainnya, dapat dihargai oleh semua pengguna, terlepas dari perangkat keras mereka.

source: While Xubuntu uses Xfce, it is not specifically targeted to Xfce enthusiasts or projects and software being hosted by the Xfce project or associating (officially or unofficially) with Xfce are not guaranteed for inclusion in Xubuntu.
id: Walaupun Xubuntu menggunakan Xfce, Xfce tidak ditargetkan secara khusus untuk penggemar atau proyek dan perangkat lunak Xfce yang dihosting oleh proyek Xfce atau bergabung (secara resmi atau tidak resmi) dengan Xfce tidak dijamin untuk dimasukkan dalam Xubuntu.

source: Areas of Focus
id: Area Fokus

source: This part of the strategy document provides a transparent framework and a set of priorities for the whole Xubuntu development and its tasks, including but not limited to decision making processes, package selection and technical dispute resolution.
id: Bagian dari dokumen strategi ini menyediakan kerangka kerja transparan dan serangkaian prioritas untuk seluruh pengembangan Xubuntu dan tugas-tugasnya, termasuk tetapi tidak terbatas pada proses pengambilan keputusan, pemilihan paket dan penyelesaian sengketa teknis.

source: The areas of focus are presented in an abstract and simple form but are also concrete enough to be actionable. As the foundation of the Xubuntu vision, the specifications in the strategy document should not be confused with release-specific goals and priorities, but instead recognized as the principles which the release-specific goals are based on.
id: Area fokus disajikan dalam bentuk abstrak dan sederhana tetapi juga cukup konkret untuk ditindaklanjuti. Sebagai dasar dari visi Xubuntu, spesifikasi dalam dokumen strategi tidak boleh dikacaukan dengan tujuan dan prioritas spesifik rilis, tetapi sebaliknya diakui sebagai prinsip yang menjadi dasar tujuan spesifik rilis.

source: Focus 1: Usability
id: Fokus 1: Kegunaan

source: Usability is one of the most important parts of an operating system which is used on a daily basis. This is why Xubuntu should be easy to use and have an appearance that doesn't get in the way. The appearance should be an all-round experience, covering all user interfaces from booting to shutting down.
id: Kegunaan adalah salah satu bagian terpenting dari sistem operasi yang digunakan setiap hari. Inilah sebabnya mengapa Xubuntu harus mudah digunakan dan memiliki tampilan yang tidak menghalangi. Tampilannya haruslah pengalaman serba, yang mencakup semua antarmuka pengguna mulai dari booting hingga mematikan.

source: Xubuntu should be localized to allow users to work in their preferred language. Another important aspect of usability is configurability. We believe Xfce gives users the possibility to configure their system in a meaningful way; other applications should live up to this expectation at least moderately well.
id: Xubuntu harus dilokalkan untuk memungkinkan pengguna bekerja dalam bahasa pilihan mereka. Aspek penting lain dari kegunaan adalah konfigurasi. Kami percaya Xfce memberi pengguna kemungkinan untuk mengkonfigurasi sistem mereka dengan cara yang bermakna; aplikasi lain harus memenuhi harapan ini setidaknya dengan cukup baik.

source: While accessibility is not one of the main priorities of Xubuntu, it should be taken into serious consideration as long as it doesn't require unreasonable efforts to integrate, implement or maintain. At least common accessibility tools should be installed in the default Xubuntu installation.
id: Walaupun aksesibilitas bukan salah satu prioritas utama Xubuntu, aksesibilitas harus dipertimbangkan dengan serius selama tidak memerlukan upaya yang tidak masuk akal untuk berintegrasi, mengimplementasikan atau memelihara. Setidaknya alat aksesibilitas umum harus diinstal di instalasi Xubuntu default.

source: Focus 2: Performance
id: Fokus 2: Kinerja

source: The Xubuntu team should strive to make Xubuntu lightweight. This means every Xubuntu release should work moderately well on machines that date to a few years before the release date. This ultimately means that newer Xubuntu releases may not able to support older computers. However, it assures that the Xubuntu team is able to work on other improvements and provide a release that is able to fulfill the expectations for a modern operating system.
id: Tim Xubuntu harus berusaha membuat Xubuntu ringan. Ini berarti setiap rilis Xubuntu harus bekerja dengan cukup baik pada mesin yang bertanggal beberapa tahun sebelum tanggal rilis. Ini pada akhirnya berarti bahwa rilis Xubuntu yang lebih baru mungkin tidak dapat mendukung komputer yang lebih lama. Namun, ia memastikan bahwa tim Xubuntu dapat mengerjakan perbaikan lain dan memberikan rilis yang mampu memenuhi harapan untuk sistem operasi modern.

source: Users wanting the most lightweight system possible should be pointed at the minimal CD, more lightweight derivatives (such as Lubuntu) or other options.
id: Pengguna yang menginginkan sistem paling ringan mungkin harus diarahkan ke CD minimal, turunan yang lebih ringan (seperti Lubuntu) atau opsi lainnya.

source: At the start of the release cycle, the minimum system requirements should be re-evaluated to determine if they continue to be realistic.
id: Pada awal siklus rilis, persyaratan sistem minimum harus dievaluasi kembali untuk menentukan apakah mereka tetap realistis.

source: Focus 3: Ready to Use
id: Fokus 3: Siap Digunakan

source: It is important for us to provide a polished and unified product that is ready for end-users. It is also a prerequisite to enabling Xubuntu as a useful, usable and effective desktop. Without the mentioned integration, the Xubuntu desktop will appear rough and unpolished which is unappealing to end-users.
id: Penting bagi kami untuk menyediakan produk yang dipoles dan disatukan yang siap untuk pengguna akhir. Ini juga merupakan prasyarat untuk mengaktifkan Xubuntu sebagai desktop yang bermanfaat, dapat digunakan dan efektif. Tanpa integrasi yang disebutkan, desktop Xubuntu akan tampak kasar dan tidak terpoles yang tidak menarik bagi pengguna akhir.

source: The integration is accomplished also by selecting applications and libraries that work well with each other as well as by applying patches to assure a more bug-free system.
id: Integrasi ini dicapai juga dengan memilih aplikasi dan perpustakaan yang bekerja dengan baik satu sama lain serta dengan menerapkan tambalan untuk memastikan sistem yang lebih bebas bug.

source: See <xref linkend="xsd-seeds-composition-package-selection"/> for guidelines on how to determine if an application fits in the Xubuntu stack.
id: Lihat <xref linkend = "xsd-seed-komposisi-paket-pilihan" /> untuk panduan tentang cara menentukan apakah suatu aplikasi cocok dengan tumpukan Xubuntu.

source: Focus 4: Community
id: Fokus 4: Komunitas

source: The Xubuntu community is an important force in creating Xubuntu and making it as perfect as it can be. It's essential that regular coordination between contributors work well. The infrastructure to allow good communication between the contributors as well as users is described more closely in <xref linkend="xsd-community"/> and <xref linkend="xsd-development"/>.
id: Komunitas Xubuntu adalah kekuatan penting dalam menciptakan Xubuntu dan membuatnya sesempurna mungkin. Sangat penting bahwa koordinasi teratur antara kontributor bekerja dengan baik. Infrastruktur untuk memungkinkan komunikasi yang baik antara kontributor dan pengguna dijelaskan lebih dekat dalam <xref linkend = "xsd-community" /> dan <xref linkend = "xsd-development" />.

source: Where possible and appropriate, the Xubuntu team should work together with other communities, including other Ubuntu teams and upstream. If cooperation at a given time is not possible but would be beneficial for both parties, the Xubuntu team should try to allocate some resources to the cooperation at a later time.
id: Jika memungkinkan dan sesuai, tim Xubuntu harus bekerja sama dengan komunitas lain, termasuk tim Ubuntu lainnya dan upstream. Jika kerja sama pada waktu tertentu tidak memungkinkan tetapi akan bermanfaat bagi kedua belah pihak, tim Xubuntu harus mencoba mengalokasikan beberapa sumber daya untuk kerja sama di lain waktu.

source: Community
id: Komunitas

source: Xubuntu Council
id: Dewan Xubuntu

source: The Xubuntu Council (later: council) is responsible for overseeing the development direction of Xubuntu and enabling the community to work with Xubuntu as smoothly as possible. The council serves a term of four releases/two years at a time, ending with an LTS release to allow long-term planning.
id: Dewan Xubuntu (nanti: dewan) bertanggung jawab untuk mengawasi arah pengembangan Xubuntu dan memungkinkan komunitas untuk bekerja dengan Xubuntu semulus mungkin. Dewan melayani masa empat rilis / dua tahun sekaligus, diakhiri dengan rilis LTS untuk memungkinkan perencanaan jangka panjang.

source: The xubuntu-council Launchpad team consists of the council members. The xubuntu-council team is the administrator for all other Xubuntu Launchpad teams, giving the council full administration access for the Xubuntu teams.
id: Tim Launchpad xubuntu-council terdiri dari anggota dewan. Tim xubuntu-dewan adalah administrator untuk semua tim Launchpad Xubuntu lainnya, memberikan dewan akses administrasi penuh untuk tim Xubuntu.

source: Membership
id: Keanggotaan

source: The council consists of 3 members, who are chosen by a <ulink url="http://civs.cs.cornell.edu/">CIVS</ulink> vote. All members in the <ulink url="https://launchpad.net/~xubuntu-team">Xubuntu Team</ulink> and/or direct members of any moderated subteams can be nominated, either by themselves or anybody else in the Xubuntu community with the nominees consent. The same group of people is eligible to vote.
id: Dewan ini terdiri dari 3 anggota, yang dipilih dengan suara <ulink url = "http://civs.cs.cornell.edu/"> CIVS </ulink>. Semua anggota dalam <ulink url = "https://launchpad.net/~xubuntu-team"> Tim Xubuntu </ulink> dan / atau anggota langsung dari setiap subte yang dimoderasi dapat dinominasikan, baik oleh mereka sendiri atau orang lain di Komunitas Xubuntu dengan persetujuan nominasi. Kelompok orang yang sama berhak untuk memilih.

source: If a council member becomes inactive for 6 months, the member shall be replaced by a new council member for the remainder of their term, elected by a new CIVS vote.
id: Jika seorang anggota dewan menjadi tidak aktif selama 6 bulan, anggota tersebut akan digantikan oleh anggota dewan yang baru untuk sisa masa jabatannya, yang dipilih dengan suara CIVS yang baru.

source: The council will decide on a chair for the whole council term. The chair will act as the official point of contact for Xubuntu.
id: Dewan akan memutuskan kursi untuk masa jabatan seluruh dewan. Kursi akan bertindak sebagai titik kontak resmi untuk Xubuntu.

source: Council operation
id: Operasi dewan
