Repository: Xubuntu/xubuntu-docs
Catalog: contributor-docs/po/*.po
Languages: id

source: After blueprints are approved, they should be finalized and detailed specifications should be written. These specifications should document the proposed changes and help guide the implementation.
id: Setelah cetak biru disetujui, mereka harus diselesaikan dan spesifikasi rinci harus ditulis. Spesifikasi ini harus mendokumentasikan perubahan yang diusulkan dan membantu memandu implementasi.

source: Once the detailed specifications are ready, the developer team should coordinate with the QA team about the required scale and schedule of testing. The QA team will then build a schedule for testing for ISO and package tests. Additional requests for testing during the cycle should be sent out only after consulting the QA team.
id: Setelah spesifikasi terperinci siap, tim pengembang harus berkoordinasi dengan tim QA tentang skala dan jadwal pengujian yang diperlukan. Tim QA kemudian akan membuat jadwal untuk pengujian ISO dan tes paket. Permintaan tambahan untuk pengujian selama siklus harus dikirim hanya setelah berkonsultasi dengan tim QA.

source: The Ubuntu freezes define the deadlines for implementation.
id: Penmbekuan Ubuntu menentukan tenggat waktu untuk implementasi.

source: Developing
id: Mengembangkan

source: In addition to implementing the features and/or improvements set in the roadmap, there are a number of tasks which will occur during each release cycle:
id: Selain menerapkan fitur dan / atau peningkatan yang ditetapkan dalam peta jalan, ada sejumlah tugas yang akan terjadi selama setiap siklus rilis:

source: Xubuntu packages will be synced or merged with Debian as appropriate
id: Paket Xubuntu akan disinkronkan atau digabungkan dengan Debian sebagaimana mestinya

source: Bugs reported by users will be reviewed, fixed, and/or passed upstream
id: Bug yang dilaporkan oleh pengguna akan ditinjau, diperbaiki, dan/atau diteruskan ke hulu

source: Attempt to reduce our delta by pushing appropriate patches upstream
id: Cobalah untuk mengurangi delta kami dengan mendorong tambalan yang sesuai di bagian hulu

source: Evaluate the seeds to ensure we are shipping the optimal software
id: Evaluasi benih untuk memastikan kami mengirimkan perangkat lunak yang optimal

source: Work on improving and updating the Xubuntu documentation and artwork
id: Bekerja untuk meningkatkan dan memperbarui dokumentasi dan karya seni Xubuntu

source: Throughout the release cycle and even more so towards the end, we will test Xubuntu to ensure that Xubuntu is a quality product that we are proud of.
id: Sepanjang siklus rilis dan terlebih lagi menjelang akhir, kami akan menguji Xubuntu untuk memastikan bahwa Xubuntu adalah produk berkualitas yang kami banggakan.

source: The most important goal of the testing is to find as many bugs as possible and report them with sufficient detail to the Ubuntu QA trackers. To read more about conducting tests and reporting them, refer to the QA tracker wiki page.
id: Tujuan paling penting dari pengujian ini adalah untuk menemukan bug sebanyak mungkin dan melaporkannya dengan cukup detail ke pelacak QA Ubuntu. Untuk membaca lebih lanjut tentang melakukan tes dan melaporkannya, lihat halaman wiki pelacak QA.

source: ISO testing
id: Pengujian ISO

source: The Xubuntu team will do its best to ensure that released milestone ISOs have enough tests completed. We will also test daily builds, upgrading through supported release paths and running the development version regularly to help detect problems and make sure the changes made meet the release goals, work as expected and do not cause regressions.
id: Tim Xubuntu akan melakukan yang terbaik untuk memastikan bahwa ISO milestone yang dirilis memiliki cukup banyak tes yang diselesaikan. Kami juga akan menguji pembangunan harian, meningkatkan melalui jalur rilis yang didukung dan menjalankan versi pengembangan secara teratur untuk membantu mendeteksi masalah dan memastikan perubahan yang dibuat memenuhi tujuan rilis, bekerja seperti yang diharapkan dan tidak menyebabkan regresi.

source: The following schedule is used for daily testing:
id: Jadwal berikut digunakan untuk pengujian harian:

source: Scheduled time
id: Waktu yang dijadwalkan

source: Action
id: Aksi

source: Beginning of cycle
id: Awal siklus

source: Send testing schedule via both the developer and users mailing lists as well as the Launchpad testing team.
id: Kirim jadwal pengujian baik melalui milis pengembang dan pengguna serta tim pengujian Launchpad.

source: Monthly
id: Bulanan

source: As required, send out reminders of the testing schedule.
id: Sesuai kebutuhan, kirim pengingat jadwal pengujian.

source: The following schedule is used for each milestone:
id: Jadwal berikut digunakan pada masing-masing milestone:

source: 7 days before release
id: 7 hari sebelum rilis

source: Pre-reminder for milestone testing
id: Pra-pengingat untuk pengujian milestone

source: 2 to 3 days before release
id: 2 hingga 3 hari sebelum rilis

source: Once appropriate testing area set up, call for testing and start milestone testing
id: Setelah area pengujian yang sesuai disiapkan, hubungi pengujian dan mulailah pengujian milestone

source: Release day
id: Hari perilisan

source: Mark images ready on the ISO tracker once the release team is confident to do so
id: Tandai gambar yang siap pada pelacak ISO setelah tim rilis yakin untuk melakukannya

source: Package testing
id: Pengujian paket

source: When being used the QA team will schedule package testing sprints to happen during the cycle between milestone testing to ensure applications that are included in Xubuntu have sufficient amount of testing conducted.
id: Saat digunakan, tim QA akan menjadwalkan sprint pengujian paket untuk terjadi selama siklus antara pengujian milestone untuk memastikan aplikasi yang termasuk dalam Xubuntu memiliki jumlah pengujian yang cukup.

source: Regardless of whether package testing is taking place during a development cycle, additional testing should be conducted for a new default application is to be included in the next Xubuntu release, when an existing application has a substantially large update in the middle of the cycle or when developers request specific testing for a specific update to an application.
id: Terlepas dari apakah pengujian paket berlangsung selama siklus pengembangan, pengujian tambahan harus dilakukan untuk aplikasi default baru akan dimasukkan dalam rilis Xubuntu berikutnya, ketika aplikasi yang ada memiliki pembaruan yang sangat besar di tengah siklus atau ketika pengembang meminta pengujian khusus untuk pembaruan spesifik ke suatu aplikasi.

source: Calls for package testing sprints will be sent out as required.
id: Panggilan untuk paket pengujian sprint akan dikirim sesuai kebutuhan.

source: Releasing
id: Merilis

source: When it comes time to deploy a release (both milestones and final) several conditions must be met:
id: Ketika tiba saatnya untuk menyebarkan rilis (baik milestone dan final) beberapa kondisi harus dipenuhi:

source: Appropriate testing has been done on the image
id: Pengujian yang sesuai telah dilakukan pada gambar

source: There are no known bugs which cause data loss or damage to hardware
id: Tidak ada bug yang diketahui yang menyebabkan kehilangan data atau kerusakan perangkat keras

source: The image must not be oversized
id: Gambar tidak boleh terlalu besar

source: Xubuntu must be of sufficient quality that it would not damage Xubuntu's, Ubuntu's, or any of the other flavors' reputation/image.
id: Xubuntu harus memiliki kualitas yang memadai sehingga tidak akan merusak Xubuntu, Ubuntu, atau reputasi/citra cita rasa lainnya.

source: When a release is made, the Xubuntu Release Team must follow the release process specified below. The release process ensures that the new release has sufficient release notes and release announcement and that all release-specific communication is updated to inform about the new release. Where needed, advice from the Ubuntu release team should be asked for.
id: Saat rilis dibuat, Tim Rilis Xubuntu harus mengikuti proses rilis yang ditentukan di bawah ini. Proses rilis memastikan bahwa rilis baru memiliki catatan rilis yang cukup dan pengumuman rilis dan bahwa semua komunikasi khusus rilis diperbarui untuk menginformasikan tentang rilis baru. Jika diperlukan, saran dari tim rilis Ubuntu harus diminta.

source: User Interface Freeze
id: Antarmuka Pengguna Freeze

source: Upload artwork and slideshow packages
id: Unggah karya seni dan paket rangkai salindia

source: Documentation String Freeze
id: String Dokumentasi Freeze

source: Update translation templates<?br?>Upload documentation packages
id: Perbarui templat terjemahan<? br?> Unggah paket dokumentasi

source: Non-Language Pack Translation Deadline
id: Batas Waktu Terjemahan Paket Non-Bahasa

source: Upload documentation and slideshow packages
id: Unggah dokumentasi dan paket rangkai salindia

source: 14 days before release
id: 14 hari sebelum rilis

source: Reminder to update the website FAQ (final release only)
id: Pengingat untuk perbarui FAQ situs web (hanya rilis final)

source: Start preparing release notes and release announcement<?br?>Make the tracker start tracking the next release
id: Mulai menyiapkan catatan rilis dan rilis pengumuman<?br?>Buat pelacak mulai melacak rilis berikutnya

source: Publish release announcement and notes<?br?>Update the website, IRC channel topics and social media outlets with new release information
id: Publikasikan pengumuman rilis dan catatan<?br?>Perbarui situs web, topik saluran IRC, dan outlet media sosial dengan informasi rilis baru

source: After release (final release only)
id: Pasca rilis (hanya rilis final)

source: Set the new development version as the default in the tracker<?br?>Set up appropriate branches (documentation, ...) in Launchpad<?br?>Review and update this page
id: Tetapkan versi pengembangan baru sebagai default di pelacak<?br?>Siapkan cabang yang sesuai (dokumentasi, ...) di Launchpad<?br?> Tinjau dan perbarui halaman ini

source: Maintaining
id: Memelihara

source: After a release is made, bugs and problems are bound to be reported. The period between the release and the start of the next release cycle is the optimal time to perform Stable Release Updates (SRU) for major bugs as long as developers do not forget to fix the issue in the next release as well, once the repository opens. Once the next release cycle has started, primary focus will be on the next release and the severity/importance of the SRU candidates will be more important when it comes to deciding whether an SRU will be performed or not.
id: Setelah rilis dibuat, bug dan masalah pasti akan dilaporkan. Periode antara rilis dan awal siklus rilis berikutnya adalah waktu yang optimal untuk melakukan Pembaruan Rilis Stabil (SRU) untuk bug utama selama pengembang tidak lupa untuk memperbaiki masalah dalam rilis berikutnya juga, setelah repositori dibuka . Setelah siklus rilis berikutnya telah dimulai, fokus utama akan berada pada rilis berikutnya dan tingkat keparahan/pentingnya kandidat SRU akan lebih penting ketika memutuskan untuk menentukan apakah SRU akan dilakukan atau tidak.

source: Xubuntu Contributor Documentation
id: Dokumentasi Kontributor Xubuntu

source: Credits and License
id: Kredit dan Lisensi

source: This documentation is maintained by the Xubuntu documentation team.
id: Dokumentasi ini dikelola oleh tim dokumentasi Xubuntu.

source: The contributors to this documentation are:
id: Kontributor untuk dokumentasi ini adalah:

source: This document is made available under the Creative Commons ShareAlike 2.5 License (CC-BY-SA).
id: Dokumen ini dikembangkan dibawah lisensi dari Creative Commons ShareAlike 2.5 License (CC-BY-SA).

source: You are free to modify, extend, and improve the Ubuntu documentation source code under the terms of this license. All derivative works must be released under this license.
id: Anda bebas untuk mengubah, memperluas, dan memperbaiki kode sumber dokumentasi Ubuntu sesuai syarat-syarat yang ada dari lisensi ini. Semua pekerjaan turunan harus diterbitkan dibawah lisensi ini.

source: This documentation is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE AS DESCRIBED IN THE DISCLAIMER.
id: Dokumentasi ini didistribusikan dengan harapan dokumentasi ini akan berguna, tetapi TANPA ADANYA JAMINAN; tanpa jaminan yang termasuk dari DAGANGAN atau KECOCOKAN UNTUK TUJUAN TERTENTU SEPERTI YANG DIGAMBARKAN DALAM PENYANGKALAN.

source: A copy of the license is available here: <link linkend="cc-by-sa">Creative Commons ShareAlike License</link>.
id: Salinan lisensi tersedia disini: <link linkend="cc-by-sa">Creative Commons ShareAlike License</link>.

source: All trademarks or registered trademarks are the property of the respective owners.
id: Semua merek dagang atau merek dagang terdaftar adalah milik dari masing-masing pemilik.

source: The Xubuntu documentation team. Xubuntu and Canonical are registered trademarks of Canonical Ltd.
id: Tim dokumentasi Xubuntu. Xubuntu dan Canonical adalah merek dagang terdaftar dari Canonical Ltd.

source: The Xubuntu documentation team
id: Tim dokumentasi Xubuntu

source: Welcome!
id: Selamat Datang!

source: This documentation is a reference for all Xubuntu contributors. The chapters of this documentation provides information on the development processes - both social and technical - that the Xubuntu contributors use as a guideline in their work.
id: Dokumentasi ini adalah referensi untuk semua kontributor Xubuntu. Bab-bab dari dokumentasi ini memberikan informasi tentang proses pengembangan - baik sosial dan teknis - yang digunakan kontributor Xubuntu sebagai pedoman dalam pekerjaan mereka.

source: There are two main appendices for this documentation:
id: Ada dua lampiran utama untuk dokumentasi ini:

source: <xref linkend="xsd"/>, which is the primary guideline in Xubuntu development.
id: <xref linkend="xsd"/>, yang merupakan pedoman utama dalam pengembangan Xubuntu.

source: <xref linkend="common-reference"/>, which describes many technical tasks that the Xubuntu developers need to use continuously.
id: <xref linkend="common-reference"/>, yang menjelaskan banyak tugas teknis yang perlu digunakan pengembang Xubuntu secara terus menerus.

source: This documentation is written with the assumption that the user knows the basics of working with Xubuntu. For example, it's expected that the reader knows how to work with a terminal and understand when they need to use one, without an explicit mention.
id: Dokumentasi ini ditulis dengan asumsi bahwa pengguna mengetahui dasar-dasar bekerja dengan Xubuntu. Sebagai contoh, diharapkan pembaca tahu bagaimana bekerja dengan terminal dan memahami kapan mereka perlu menggunakannya, tanpa menyebutkan secara eksplisit.

source: Subteam Documentation
id: Dokumentasi Subteam

source: Getting Started
id: Memulai

source: Important Places
id: Tempat-tempat Penting

source: The IRC channel #xubuntu-devel is where most of the daily communication and cooperation about Xubuntu development happens. It's also the place to get to know people and get yourself known.
id: Saluran IRC #ubuntu-devel adalah tempat dimana sebagian besar komunikasi dan kerja sama harian tentang pengembangan Xubuntu terjadi. Ini juga tempat untuk mengenal orang dan membuat diri Anda dikenal.

source: Status Tracker
id: Pelacak Status

source: The development for the current Xubuntu release is tracked in the <ulink url="http://dev.xubuntu.org/">Xubuntu development tracker</ulink>. In addition to showing the current status for blueprints and their individual work items, the tracker displays some general progress. Finally, you can access the team calendar, Xubuntu wiki, development mailing list and join the development IRC channel #xubuntu-devel from it.
id: Pengembangan untuk rilis Xubuntu saat ini dilacak di <ulink url="http://dev.xubuntu.org/"> Pelacak pengembangan Xubuntu</ulink>. Selain menunjukkan status saat ini untuk cetak biru dan item pekerjaan masing-masing, pelacak menampilkan beberapa kemajuan umum. Akhirnya, Anda dapat mengakses kalender tim, wiki Xubuntu, milis pengembangan dan bergabung dengan saluran IRC pengembangan # xubuntu-devel darinya.

source: Documentation
id: Dokumentasi

source: The Xubuntu documentation oversees the user documentation and contributor documentation as translations for the documentation and other packages important to Xubuntu. In addition the team works together with other teams in producing content and more.
id: Dokumentasi Xubuntu mengawasi dokumentasi pengguna dan dokumentasi kontributor sebagai terjemahan untuk dokumentasi dan paket lain yang penting bagi Xubuntu. Selain itu tim bekerja sama dengan tim lain dalam memproduksi konten dan banyak lagi.

source: Working with the documentation
id: Bekerja dengan dokumentasi

source: Editing the documentation
id: Menyunting dokumentasi

source: First make sure you have the Bzr branch <literal><placeholder-1/>lp:xubuntu-docs</literal> and the build dependencies for <literal><placeholder-2/>xubuntu-docs</literal>.
id: Pertama-tama pastikan Anda memiliki cabang Bzr <literal><placeholder-1/> lp:xubuntu-docs</literal> dan dependensi build untuk <literal><placeholder-2/>xubuntu-docs</literal>.

source: Changes to the user documentation should be made to the .xml files under <literal>user-docs/C/</literal>. Once edited and saved, push changes to your local branch as detailed in <xref linkend="bzr"/>.
id: Perubahan pada dokumentasi pengguna harus dilakukan ke berkas .xml di bawah <literal>user-docs/C/</literal>. Setelah disunting dan disimpan, dorong perubahan ke cabang lokal Anda sebagaimana dirinci dalam <xref linkend="bzr"/>.

source: Similarly, changes to the contributor documentation should be made to the .xml files under <literal>contributor-docs/C/</literal>.
id: Demikian pula, perubahan pada dokumentasi kontributor harus dibuat ke berkas .xml di bawah <literal>contributor-docs/C/</literal>.

source: Notes on the contributor documentation
id: Catatan pada dokumentasi kontributor

source: For various reasons, the contributor documentation is more complex in structure than the user documentation. Particularly, pay attention to the following when working with the subteam documentation:
id: Karena berbagai alasan, dokumentasi kontributor lebih kompleks dalam struktur daripada dokumentasi pengguna. Khususnya, perhatikan hal-hal berikut ketika bekerja dengan dokumentasi subteam:

source: If you want to create an introductory paragraph that is shown on the subteam main page, simply do not wrap it inside a <literal>&lt;section&gt;</literal> element. Otherwise this will be chunked into a separate HTML file.
id: Jika Anda ingin membuat paragraf pengantar yang ditampilkan di halaman utama subteam, cukup jangan membungkusnya di dalam elemen <literal>&lt;section&gt;</literal>. Kalau tidak, ini akan dipotong menjadi file HTML yang terpisah.

source: If you want a subsection of a section to be visible in the Table of Contents, add the <literal>&lt;role="toc"&gt;</literal> attribute for the <literal>&lt;section&gt;</literal> element. For an actual example, see the <literal>qa-*</literal> files.
id: Jika Anda ingin subbagian dari suatu bagian dapat terlihat di Daftar Isi, tambahkan atribut <literal>&lt;role="toc"&gt;</literal> untuk elemen <literal>&lt;section&gt;</literal>. Untuk contoh aktual, lihat berkas<literal> qa-*</literal>.

source: The sections are chunked up to the first level; this means all direct <literal>&lt;section&gt;</literal> ascendants of <literal>&lt;chapter&gt;</literal> elements will be chunked into separate HTML files. If you want to avoid this (for example if your chapter is very short), insert the <literal>&lt;?dbhtml stop-chunking?&gt;</literal> after the <literal>&lt;title&gt;</literal> element of your chapter. Note that doing this will not stop the Table of Contents from being printed with each section. You can use the <literal>&lt;simplesect&gt;</literal> element again to hide sections from the Table of Contents. If you do this, make sure you don't insert any elements after the <literal>&lt;simplesect&gt;</literal> elements in your chapter, as this will invalidate the document.
id: Bagian-bagian tersebut dibagi hingga tingkat pertama; ini berarti semua elemen <literal>&lt;section&gt;</literal> langsung dari <literal>&lt;chapter&gt;</literal> elemen akan dipotong menjadi file HTML terpisah. Jika Anda ingin menghindari ini (misalnya jika bab Anda sangat pendek), masukkan bb <literal>&lt;?dbhtml stop-chunking?&gt;</literal> setelah elemen <literal>&lt;title&gt;</literal> dari bab Anda. Perhatikan bahwa melakukan ini tidak akan menghentikan Daftar Isi untuk dicetak pada setiap bagian. Anda dapat menggunakan elemen <literal>&lt;simplesect&gt;</literal> lagi untuk menyembunyikan bagian dari Daftar Isi. Jika Anda melakukan ini, pastikan Anda tidak memasukkan elemen apa pun setelah elemen <literal>&lt;simplesect&gt;</literal> dalam bab Anda, karena ini akan membatalkan dokumen.

source: Translations
id: Terjemahan

source: Packages to be translated
id: Paket untuk diterjemahkan

source: These are packages that the Xubuntu team considers important, and should take precedence when translating.
id: Ini adalah paket yang dianggap penting oleh tim Xubuntu, dan harus diutamakan saat menerjemahkan.

source: Packages that only exist in Xubuntu
id: Paket yang hanya ada di Xubuntu

source: These packages only exist in Xubuntu, so their translation is solely dealt with by Xubuntu translators. These are of high importance for the Xubuntu team.
id: Paket-paket ini hanya ada di Xubuntu, jadi terjemahannya hanya ditangani oleh penerjemah Xubuntu. Ini sangat penting bagi tim Xubuntu.

source: Xubuntu Documentation
id: Dokumentasi Xubuntu

source: Xubuntu Default Settings
id: Pengaturan Baku Xubuntu

source: Ubiquity Slideshow for Xubuntu
id: Rangkai salindia Ubiquity untuk Xubuntu

source: Used by Xubuntu
id: Digunakan oleh Xubuntu

source: These packages are used by Xubuntu and provide features to the Xubuntu experience. When these are translated, the base system is immediately more usable for more people.
id: Paket-paket ini digunakan oleh Xubuntu dan menyediakan fitur untuk pengalaman Xubuntu. Ketika ini diterjemahkan, sistem dasar segera lebih bermanfaat bagi lebih banyak orang.

source: Translation guidelines for Xubuntu packages
id: Pedoman terjemahan untuk paket Xubuntu

source: These guidelines apply mostly to the Xubuntu documentation. They can generally be applied to any translation with minor modification. If unsure, ask the Documentation team members for assistance.
id: Pedoman ini sebagian besar berlaku untuk dokumentasi Xubuntu. Mereka umumnya dapat diterapkan pada terjemahan apa pun dengan sedikit modifikasi. Jika tidak yakin, minta bantuan anggota tim Dokumentasi.

source: The <ulink url="https://wiki.ubuntu.com/Translations/Contact/Teams">language-specific translation teams</ulink> usually want to encourage some conventions; please contact the appropriate language-specific team before translating.
id: <ulink url="https://wiki.ubuntu.com/Translations/Contact/Teams"> Tim penerjemah khusus bahasa</ulink> biasanya ingin mendorong beberapa konvensi; silakan hubungi tim khusus bahasa yang sesuai sebelum menerjemahkan.

source: More general translation guidelines can be found at the <ulink url="https://help.launchpad.net/Translations/Guide">Launchpad translations guide</ulink>.
id: Pedoman terjemahan yang lebih umum dapat ditemukan di <ulink url="https://help.launchpad.net/Translations/Guide">Panduan terjemahan Launchpad</ulink>.

source: Maintain translation validity
id: Pertahankan validitas terjemahan
