Repository: Xubuntu/xubuntu-docs
Catalog: contributor-docs/po/*.po
Languages: id

source: Getting and updating Git repositories
id: Mendapatkan dan memperbarui repositori Git

source: After you have set up Git, you can get a local copy of a repository by running <userinput>git clone LOCATION</userinput>. This will create a directory for the repository.
id: Setelah mengatur Git, Anda bisa mendapatkan salinan lokal repositori dengan menjalankan <userinput>git clone LOCATION</userinput>. Ini akan membuat direktori untuk repositori.

source: To make sure your local copy of a branch is up to date, run <userinput>git pull</userinput> inside the branch directory.
id: Untuk memastikan salinan cabang lokal Anda sudah terbaru, jalankan <userinput>git pull</userinput> di dalam direktori cabang.

source: Pushing to Git repositories
id: Mendorong ke repositori Git

source: When you have worked on your changes and want to push them to a remote repository, do the following in the local branch:
id: Ketika Anda telah mengerjakan perubahan Anda dan ingin mendorongnya ke repositori jarak jauh, lakukan hal berikut di cabang lokal:

source: To rename or move files, run <userinput>git mv OLD NEW</userinput>. This helps to keep the resulting diff meaningful, while Git should figure this out automatically.
id: Untuk mengganti nama atau memindahkan berkas, jalankan <userinput>git mv OLD NEW</userinput>. Ini membantu menjaga perbedaan yang dihasilkan bermakna, sementara Git harus mencari tahu ini secara otomatis.

source: To remove files, run <userinput>git rm FILE</userinput>. This also stops tracking the specified files, while it's redundant if all changes are staged later anyway.
id: Untuk menghapus berkas, jalankan <userinput>git rm FILE</userinput>. Ini juga berhenti melacak berkasyang ditentukan, sementara itu redundan jika semua perubahan dipentaskan nanti.

source: If you have added files, run <userinput>git add .</userinput> in the branch root. This starts tracking any files in the branch that aren't currently, and also stages any changes.
id: Jika Anda telah menambahkan berkas, jalankan <userinput>git add .</userinput> di root cabang. Ini mulai melacak semua berkasdi cabang yang saat ini tidak ada, dan juga melakukan perubahan apa pun.

source: To check the status of the branch, run <userinput>git status</userinput>.
id: Untuk memeriksa status cabang, jalankan <userinput>git status</userinput>.

source: Commit your changes by running <userinput>git commit -a</userinput>. This stages any changes, and will open a text editor to enter the commit message.
id: Komit perubahan Anda dengan menjalankan <userinput>git commit -a</userinput>. Ini tahap setiap perubahan, dan akan membuka editor teks untuk memasukkan pesan komit.

source: After you have done one or more commits, run <userinput>git push LOCATION BRANCH</userinput> to push your changes to a remote repository.
id: Setelah Anda melakukan satu atau lebih commit, jalankan <userinput>git push LOCATION BRANCH</userinput> untuk mendorong perubahan Anda ke repositori jarak jauh.

source: The commit message should summarize all the changes you have done after the last commit, you can specify it directly by using <literal>-m MESSAGE</literal>.
id: Pesan komit harus merangkum semua perubahan yang telah Anda lakukan setelah komit terakhir, Anda dapat menentukannya langsung dengan menggunakan <literal>-m MESSAGE</literal>.

source: Build dependencies
id: Membangun dependensi

source: Before you can build a package from source, you will usually need to install its build dependencies.
id: Sebelum Anda bisa membangun sebuah paket dari sumber, Anda biasanya perlu menginstal dependensi build-nya.

source: To do this, simply run <userinput>sudo apt-get build-dep PACKAGE</userinput>.
id: Untuk melakukan ini, cukup jalankan <userinput>sudo apt-get build-dep PACKAGE</userinput>.

source: Launchpad is the primary platform used for Xubuntu development. Historically, the version control system used on Launchpad is Bazaar, but it recently added <ulink url="https://help.launchpad.net/Code/Git">support for Git</ulink>, too.
id: Launchpad adalah platform utama yang digunakan untuk pengembangan Xubuntu. Secara historis, sistem kontrol versi yang digunakan di Launchpad adalah Bazaar, tetapi baru-baru ini ditambahkan <ulink url="https://help.launchpad.net/Code/Git"> dukungan untuk Git</ulink> juga.

source: Setting up a Launchpad account
id: Mengatur akun Launchpad

source: For information on setting up a Launchpad account, see <ulink url="https://help.launchpad.net/YourAccount/NewAccount">Creating a new account</ulink>.
id: Untuk informasi tentang pengaturan akun Launchpad, lihat <ulink url="https://help.launchpad.net/YourAccount/NewAccount">Membuat akun baru</ulink>.

source: Useful QA Links
id: Tautan QA yang berguna

source: Xubuntu Testers
id: Penguji Xubuntu

source: ISO Tracker
id: Pelacak ISO

source: Package Tracker
id: Pelacak Paket

source: Ubuntu QA Team Wiki
id: Wiki Tim QA Ubuntu

source: Ubuntu Manual Tests
id: Pengujian Manual Ubuntu

source: translator-credits
id: Launchpad Contributions: Arief Setiadi Wibowo https://launchpad.net/~q-thrynx William Andrew Conna https://launchpad.net/~williamandrewconna
