Repository: Xubuntu/xubuntu-docs
Catalog: contributor-docs/po/*.po
Languages: id

source: Join the Xubuntu Testers <ulink url="https://launchpad.net/~xubuntu-testers">Launchpad</ulink> team.
id: Bergabunglah dengan Penguji Xubuntu <ulink url="https://launchpad.net/~xubuntu-testers"> Launchpad</ulink>.

source: Consider adding your details to the <ulink url="http://wiki.xubuntu.org/qa/teamhardware">Hardware</ulink> page. We can use this data to request specific testing from specific testers.
id: Pertimbangkan untuk menambahkan detail Anda ke halaman <ulink url="http://wiki.xubuntu.org/qa/teamhardware"> Perangkat Keras</ulink>. Kami dapat menggunakan data ini untuk meminta pengujian khusus dari penguji tertentu.

source: Getting the ISO
id: Mendapatkan ISO

source: ISOs can be obtained through a few methods. The simplest method is to visit the <ulink url="http://iso.qa.ubuntu.com/">ISO</ulink> tracker. Follow the testcases through release codename to Xubuntu's group of tests. Then choose either 64 or 32 bit. Download links are available there.
id: ISO dapat diperoleh melalui beberapa metode. Metode paling sederhana adalah dengan mengunjungi pelacak <ulink url="http://iso.qa.ubuntu.com/"> ISO</ulink>. Ikuti testcases melalui rilis kode nama ke grup tes Xubuntu. Kemudian pilih 64 atau 32 bit. Tautan unduhan tersedia di sana.

source: When testing more regularly, you might find (especially where bandwidth is an issue for you) using the <ulink url="https://help.ubuntu.com/community/ZsyncCdImage">zsync</ulink> link more appropriate. This is will just grab the difference between your local copy and the current one.
id: Saat menguji lebih teratur, Anda mungkin menemukan (terutama di mana bandwidth menjadi masalah bagi Anda) menggunakan <ulink url="https://help.ubuntu.com/community/ZsyncCdImage"> tautan zsync</ulink> lebih tepat. Ini hanya akan mengambil perbedaan antara salinan lokal Anda dan yang saat ini.

source: Methods of testing
id: Metode pengujian

source: Now you've set up your basic contact(s) and have your ISO, you are in a position to test it.
id: Sekarang anda telah mengatur kontak dasar dan mendapatkan ISO anda, anda dalam posisi akan mengetesnya.

source: There are two main methods of testing the ISO:
id: Ada dua metode utama pengujian ISO:

source: Using a virtual machine enables you to carry on using a normal release when testing our ISOs. You can install a virtual machine by directly using your downloaded ISO.
id: Menggunakan mesin virtual memungkinkan Anda untuk terus menggunakan rilis normal saat menguji ISO kami. Anda dapat menginstal mesin virtual dengan langsung menggunakan ISO yang Anda unduh.

source: Install the ISO to hardware where that possibility is available. This is more important towards the end of the development cycle. You will necessarily need to have the ISO in some bootable medium. A member of Xubuntu's Website team details a simple method for preparing a bootable <ulink url="http://princessleia.com/journal/2016/03/xubuntu-16-04-iso-testing-tips/">USB</ulink> stick with Gnome Disks.
id: Instal ISO ke perangkat keras di mana kemungkinan itu tersedia. Ini lebih penting menjelang akhir siklus pengembangan. Anda harus memiliki ISO di beberapa media yang dapat di-boot. Seorang anggota tim Situs Web Xubuntu merincikan metode sederhana untuk menyiapkan bootable <ulink url="http://princessleia.com/journal/2016/03/xubuntu-16-04-iso-testing-tips/"> USB </ulink> tetap dengan Gnome Disk.

source: While it is possible to use VirtualBox, past experience has shown that issues found when testing in VirtualBox are hard to replicate elsewhere. You might want to look into using <ulink url="https://help.ubuntu.com/community/KVM">KVM</ulink>. Members of Xubuntu QA have some experience with using this for testing and can help.
id: Meskipun dimungkinkan untuk menggunakan VirtualBox, pengalaman masa lalu menunjukkan bahwa masalah yang ditemukan ketika pengujian di VirtualBox sulit untuk ditiru di tempat lain. Anda mungkin ingin melihat menggunakan <ulink url="https://help.ubuntu.com/community/KVM"> KVM </ulink>. Anggota Xubuntu QA memiliki pengalaman menggunakan ini untuk pengujian dan dapat membantu.

source: Reporting your result
id: Melaporkan hasil Anda

source: There are two QA trackers we use.
id: Ada dua pelacak QA yang kami gunakan.

source: The ISO tracker mentioned above for any testing done with an ISO either an install or an upgrade test.
id: Pelacak ISO yang disebutkan di atas untuk pengujian apa pun yang dilakukan dengan ISO baik tes instal maupun upgrade.

source: The <ulink url="http://packages.qa.ubuntu.com/">Package</ulink> tracker, which is used when we are testing applications during a cycle.
id: Pelacak <ulink url="http://packages.qa.ubuntu.com/">Paket </ulink>, yang digunakan saat kami menguji aplikasi selama suatu siklus.

source: These trackers form the backbone of what we are able to gain from your testing. It is important that you report your results.
id: Pelacak ini membentuk tulang punggung dari apa yang dapat kami peroleh dari pengujian Anda. Penting bahwa Anda melaporkan hasil Anda.

source: The next two sections of these documents go into more detail on how you can test for us and how to report bugs for us.
id: Dua bagian selanjutnya dari dokumen ini menjelaskan secara lebih rinci tentang bagaimana Anda dapat menguji kami dan bagaimana melaporkan bug untuk kami.

source: Dealing with bugs
id: Berurusan dengan bug

source: Using tags for Xubuntu bug reports
id: Menggunakan tag untuk laporan bug Xubuntu

source: So that we can easily find bugs for Xubuntu during a development cycle, there a few tags you can add to your bug reports. We assume that a tag for the cycle codename is included, if it is not please add one.
id: Agar kami dapat dengan mudah menemukan bug untuk Xubuntu selama siklus pengembangan, ada beberapa tag yang dapat Anda tambahkan ke laporan bug Anda. Kami menganggap bahwa tag untuk nama kode siklus disertakan, jika tidak, tambahkan saja.

source: ppa: add this tag when you've reported a bug against a package from one of the 3 develeopment PPAs
id: ppa: tambahkan tag ini ketika Anda melaporkan bug terhadap paket dari salah satu dari 3 PPA pengembangan

source: usability: add this tag if the issue you are reporting is not a standard bug, but one which might be deemed wishlist, such as multiple selection of results in the Catfish results window
id: kegunaan: tambahkan tag ini jika masalah yang Anda laporkan bukan bug standar, tetapi salah satu yang mungkin dianggap sebagai daftar harapan, seperti beberapa pilihan hasil di jendela hasil Catfish

source: Normal bug reporting
id: Pelaporan bug normal

source: Anybody using Xubuntu can file (or in other words, report) bugs, even with no experience at all. Filing bugs is important because in some cases, bugs can go unnoticed unless an end user files them.
id: Siapa pun yang menggunakan Xubuntu dapat mengajukan (atau dengan kata lain, melaporkan) bug, bahkan tanpa pengalaman sama sekali. Mengarsipkan bug penting karena dalam beberapa kasus, bug dapat diketahui tanpa disadari oleh pengguna akhir.

source: Before submitting a bug, you should look at the <ulink url="https://launchpad.net/ubuntu/+bugs">existing bug reports</ulink> and release notes to verify the bug hasn’t been reported already. If the bug has not already been reported, you should file a new bug report. It is sensible to read through the <ulink url="https://help.ubuntu.com/community/ReportingBugs">bug reporting guidelines</ulink> before filing your first bug.
id: Sebelum mengirimkan bug, Anda harus melihat <ulink url="https://launchpad.net/ubuntu/+bugs"> laporan bug yang ada </ulink> dan lepaskan catatan untuk memverifikasi bug yang belum pernah dilaporkan. Jika bug belum dilaporkan, Anda harus mengajukan laporan bug baru. Masuk akal untuk membaca <ulink url="https://help.ubuntu.com/community/ReportingBugs"> pedoman pelaporan bug </ulink> sebelum mengajukan bug pertama Anda.

source: In the most situations, it is easiest to file a bug by opening a new Terminal and type ubuntu-bug package-name, where package-name is the package you want to file bug against. If you don’t know which package you should file the bug against, refer to the instructions on <ulink url="https://wiki.ubuntu.com/Bugs/FindRightPackage">finding the right package</ulink>. When filing the bug, it is better to have too much information than too little.
id: Dalam kebanyakan situasi, paling mudah untuk mengajukan bug dengan membuka Terminal baru dan ketik ubuntu-bug package-name, di mana nama-paket adalah paket yang ingin Anda ajukan bug. Jika Anda tidak tahu paket mana yang harus Anda tempati bugnya, lihat instruksi di <ulink url="https://wiki.ubuntu.com/Bugs/FindRightPackage"> menemukan paket yang tepat</ulink>. Saat mengajukan bug, lebih baik memiliki terlalu banyak informasi daripada terlalu sedikit.

source: If you are unsure of the package name to report against, you can use your mouse to click on the application window; in a terminal run <userinput>ubuntu-bug -w</userinput>, click to close the message window and then click on the application window.
id: Jika anda tidak yakin dengan nama paket yang akan anda laporkan, anda dapat menggunakan tetikus untuk mengklik pada jendela aplikasi; di terminal jalankan <userinput>ubuntu-bug-w</userinput>, klik untuk meutup jendela pesan dan kemudian klik pada jendela aplikasi.

source: Reporting bugs with PPAs
id: Melaporkan bug dengan PPA

source: When you encounter a bug with a package from a PPA, you’ll need to file the bug report manually. Once you’ve got the offending package name, go to <literal>https://bugs.launchpad.net/ubuntu/+source/PACKAGENAME/+filebug</literal>.
id: Saat Anda menemukan bug dengan paket dari PPA, Anda harus mengajukan laporan bug secara manual. Setelah Anda mendapatkan nama paket yang menyinggung, buka <literal> https://bugs.launchpad.net/ubuntu/+source/PACKAGENAME/+filebug </literal>.

source: Crash logs related to the package can be found in <literal>/var/crash/</literal>. This directory sometimes requires superuser (<literal>sudo</literal>) permissions to view and extract the contents. These logs can be particularly valuable to include in your bug report, but be sure to review them as they may contain sensitive or personally identifiable material.
id: Log kerusakan yang terkait dengan paket dapat ditemukan di <literal>/var/crash/</literal>. Direktori ini terkadang memerlukan izin superuser (<literal>sudo</literal>) untuk melihat dan mengekstrak isinya. Log-log ini bisa sangat berharga untuk dimasukkan dalam laporan bug Anda, tetapi pastikan untuk meninjaunya karena mungkin mengandung materi yang sensitif atau dapat diidentifikasi secara pribadi.

source: Be sure to follow the above general guidelines, and also add the ppa tag so it is clear to developers that this is an unsupported package.
id: Pastikan untuk mengikuti pedoman umum di atas, dan juga menambahkan tag ppa sehingga jelas bagi pengembang bahwa ini adalah paket yang tidak didukung.

source: Triaging bugs is getting bug reports in a state where they are useful for developers by making sure bug reports have useful titles, descriptions, appropriate logs and more. To get started, read the page on <ulink url="https://wiki.ubuntu.com/Bugs/Triage">triaging bugs</ulink> in the Ubuntu wiki.
id: Triaging bug adalah mendapatkan laporan bug dalam keadaan di mana mereka berguna bagi pengembang dengan memastikan laporan bug memiliki judul, deskripsi, log yang sesuai dan banyak lagi. Untuk memulai, baca halaman di <ulink url="https://wiki.ubuntu.com/Bugs/Triage"> triaging bugs</ulink> di wiki Ubuntu.

source: After you have made yourself familiar with the aspects of triaging bugs, you can start triaging <ulink url="https://bugs.launchpad.net/~xubuntu-bugs/+packagebugs">Xubuntu bugs</ulink>. Please note that the bug status and importance can only be changed by members of the <ulink url="https://wiki.ubuntu.com/UbuntuBugControl">Ubuntu Bug Control</ulink> team &ndash; in the beginning, you will need to report triaged bugs for the team in #ubuntu-bugs on Libera. After you have demonstrated your ability to triage bugs, you will gain more responsibilities from the Bug Control team.
id: Setelah Anda terbiasa dengan aspek-aspek triaging bug, Anda dapat mulai melakukan triase <ulink url="https://bugs.launchpad.net/~xubuntu-bugs/+packagebugs"> bug Xubuntu</ulink>. Harap perhatikan bahwa status dan kepentingan bug hanya dapat diubah oleh anggota <ulink url="https://wiki.ubuntu.com/UbuntuBugControl"> tim Ubuntu Bug Control</ulink> & ndash; pada awalnya, Anda harus melaporkan bug triaged untuk tim di # ubuntu-bug di Libera. Setelah Anda menunjukkan kemampuan untuk melakukan triase bug, Anda akan mendapatkan lebih banyak tanggung jawab dari tim Bug Control.

source: As you gain experience on triaging Xubuntu bugs, you may want to take a look at new bugs that mention Xubuntu. Triaging new bugs is recommended for those who are more familiar with both triaging and Xubuntu generally, since not all of the new bugs mentioning Xubuntu are actually Xubuntu bugs.
id: Ketika Anda mendapatkan pengalaman dalam triaging bug Xubuntu, Anda mungkin ingin melihat bug baru yang menyebutkan Xubuntu. Triaging bug baru direkomendasikan bagi mereka yang lebih terbiasa dengan triaging dan Xubuntu secara umum, karena tidak semua bug baru yang menyebutkan Xubuntu sebenarnya adalah bug Xubuntu.

source: Forwarding bugs upstream
id: Meneruskan bug di bagian hulu

source: When bugs are forwarded upstream, all users of the relevant software will benefit from the debugging, triaging and patching work carried out by bug triagers and developers.
id: Ketika bug diteruskan ke hulu, semua pengguna perangkat lunak yang relevan akan mendapat manfaat dari pekerjaan debugging, triaging dan patching yang dilakukan oleh pemicu bug dan pengembang.

source: Once it has been determined that a bug is not caused by a change in Xubuntu, bugs can be forwarded to their respective upstream projects to be reviewed. For example, all appropriate Xfce bugs should be filed in the <ulink url="https://bugzilla.xfce.org/">Xfce bug tracker</ulink>. In addition, to track the status of the bug in Ubuntu, the bug in Launchpad should be linked with the upstream bug.
id: Setelah ditentukan bahwa bug tidak disebabkan oleh perubahan Xubuntu, bug dapat diteruskan ke masing-masing proyek hulu untuk ditinjau. Misalnya, semua bug Xfce yang sesuai harus diajukan di <ulink url="https://bugzilla.xfce.org/">Xfce bug tracker</ulink>. Selain itu, untuk melacak status bug di Ubuntu, bug di Launchpad harus dikaitkan dengan bug hulu.

source: The Ubuntu wiki has an extensive page on <ulink url="https://wiki.ubuntu.com/Bugs/Upstream">forwarding bugs upstream</ulink> along with instructions on how to report bugs in the upstream bug trackers. Detailed information on the way to add an upstream bug to Launchpad can be found on the <ulink url="https://wiki.ubuntu.com/Bugs/Watches">Bugs/Watches</ulink> page on the Ubuntu wiki.
id: Wiki Ubuntu memiliki halaman luas tentang <ulink url="https://wiki.ubuntu.com/Bugs/Upstream"> penerusan bug hulu</ulink> bersama dengan instruksi tentang cara melaporkan bug di pelacak bug hulu. Informasi terperinci tentang cara menambahkan bug hulu ke Launchpad dapat ditemukan di halaman <ulink url="https://wiki.ubuntu.com/Bugs/Watches"> Bugs/Watches</ulink> di wiki Ubuntu.

source: Processes
id: Proses

source: This section describes some of the community processes for Xubuntu development. The processes should be used as guidelines: the main goal of this section is to describe <emphasis>what we do</emphasis>, not so much to describe <emphasis>what we should do</emphasis>.
id: Bagian ini menjelaskan beberapa proses komunitas untuk pengembangan Xubuntu. Proses harus digunakan sebagai pedoman: tujuan utama dari bagian ini adalah untuk menggambarkan <emphasis> apa yang kita lakukan </emphasis>, bukan untuk menggambarkan <emphasis> apa yang harus kita lakukan </emphasis>.

source: In addition to the Xubuntu processes described below, there are several generic Ubuntu processes that are useful for the team and described elsewhere:
id: Selain proses Xubuntu yang diuraikan di bawah, ada beberapa proses Ubuntu generik yang berguna untuk tim dan dijelaskan di tempat lain:

source: <ulink url="https://wiki.ubuntu.com/FreezeExceptionProcess">Freeze exception process</ulink> for getting to upload changes after a relevant freeze
id: <ulink url="https://wiki.ubuntu.com/FreezeExceptionProcess"> Bekukan proses pengecualian</ulink> untuk mendapatkan unggahan perubahan setelah pembekuan yang relevan

source: <ulink url="https://wiki.ubuntu.com/SponsorshipProcess">Sponsorship process</ulink> for getting new package uploads in the archive
id: <ulink url="https://wiki.ubuntu.com/SponsorshipProcess"> Proses sponsor</ulink> untuk mendapatkan unggahan paket baru di arsip

source: Meetings
id: Rapat

source: Chairing a meeting
id: Mengetuai rapat

source: The community meetings are held in <literal>#xubuntu-devel</literal> and chaired by the Xubuntu team leads. The chairing team leader is cycled based on the team name. The actual upcoming chair list can be found in the comments of the Meetings page.
id: Pertemuan komunitas diadakan di <literal> #xubuntu-devel</literal> dan diketuai oleh pimpinan tim Xubuntu. Ketua tim yang memimpin bersepeda berdasarkan nama tim. Daftar ketua aktual yang akan datang dapat ditemukan di komentar dari halaman Rapat.

source: The chair is responsible for scheduling and announcing the meeting on the development mailing list, and for updating the wiki with the meeting time.
id: Ketua bertanggung jawab untuk menjadwalkan dan mengumumkan pertemuan di milis pengembangan, dan untuk memperbarui wiki dengan waktu rapat.

source: During any of the sections in the meeting, the chair can assign action items to individuals or teams with their permission. The chair should take care to copy these items to blueprint work items where applicable.
id: Selama salah satu bagian dalam rapat, ketua dapat memberikan item tindakan kepada individu atau tim dengan izin mereka. Kursi harus berhati-hati untuk menyalin item-item ini ke item pekerjaan cetak biru jika berlaku.

source: The meeting minutes will need to be added to the wiki after the meeting has ended. To do this, go to the <ulink url="https://wiki.ubuntu.com/Xubuntu/Meetings/Archive/Minutes/">Minutes startpage</ulink> and use the input box for creating a minutes page. You will get the content for the page directly from meetingology Moin output URL.
id: Risalah rapat perlu ditambahkan ke wiki setelah rapat berakhir. Untuk melakukan ini, buka <ulink url="https://wiki.ubuntu.com/Xubuntu/Meetings/Archive/Minutes/">Menit startpage</ulink> dan gunakan kotak masukan untuk membuat halaman menit. Anda akan mendapatkan konten untuk halaman langsung dari URL keluaran meetingology Moin.

source: After you have created a minutes page, don't forget to update the include in <ulink url="https://wiki.ubuntu.com/Xubuntu/Meetings/">the Meetings main page</ulink>.
id: Setelah Anda membuat halaman menit, jangan lupa untuk memperbarui menyertakan di <ulink url="https://wiki.ubuntu.com/Xubuntu/Meetings/">halaman utama Rapat</ulink>.

source: Website updates
id: Pembaruan situs web

source: Update on release
id: Pembaruan saat rilis

source: Update screenshots on the <ulink url="http://xubuntu.org/screenshots/">Screenshots</ulink> page
id: Perbarui tangkapan layar pada halaman <ulink url="http://xubuntu.org/screenshots/">Tangkapan Layar</ulink>

source: Rotate the <ulink url="http://xubuntu.org/press/">In the Press</ulink> section
id: Putar <ulink url="http://xubuntu.org/press/">di bagian Press</ulink>

source: Add new release to the <ulink url="http://xubuntu.org/help/">Help &amp; Support</ulink> and <ulink url="http://xubuntu.org/getxubuntu/">Get Xubuntu</ulink> pages
id: Tambahkan rilis baru ke halaman <ulink url="http://xubuntu.org/help/">Bantuan &amp; Mendukung</ulink> dan <ulink url="http://xubuntu.org/getxubuntu/">Dapatkan Xubuntu</ulink>

source: Change front page widget to point to a new release
id: Ubah widget halaman depan untuk menunjuk ke rilis baru

source: When one is set, remove the widget mentioning testing from the front page
id: Ketika seseorang diatur, hapus widget yang menyebutkan pengujian dari halaman depan

source: When one is prepared, release a FAQ blog article
id: Ketika seseorang siap, lepaskan artikel blog FAQ

source: Update on point releases
id: Pembaruan pada rilis titik

source: Update download links on the <ulink url="http://xubuntu.org/getxubuntu/">Get Xubuntu</ulink> page
id: Perbarui tautan unduhan di halaman <ulink url="http://xubuntu.org/getxubuntu/">Dapatkan Xubuntu</ulink>

source: Update the front page widget
id: Perbarui widget halaman depan

source: Update on release EOL
id: Pembaruan pada rilis EOL

source: Update the supported releases list on the <ulink url="http://xubuntu.org/help/">Help &amp; Support</ulink> page
id: Perbarui daftar yang didukung pada laman<ulink url="http://xubuntu.org/help/">Bantuan &amp; Dukungan</ulink>

source: Update the <ulink url="http://docs.xubuntu.org/">documentation subdomain</ulink> from <literal><placeholder-1/>lp:xubuntu-website/docs-startpage</literal>
id: Perbarui <ulink url="http://docs.xubuntu.org/">subdomain dokumentasi</ulink> dari <literal><placeholder-1/>lp:xubuntu-website/docs-startpage</literal>

source: Release Cycle
id: Siklus Rilis

source: This section loosely describes the stages of a development and release cycle.
id: Bagian ini secara longgar menjelaskan tahapan pengembangan dan siklus rilis.

source: Planning
id: Perencanaan

source: Planning the release is conducted in three phases:
id: Perencanaan rilis didasarkan pada tiga tahap:

source: Brainstorming
id: Tukar pikiran

source: Approving blueprints
id: Menerima cetak biru

source: Finalizing specifications
id: Menyelesaikan spesifikasi

source: During the brainstorming phase the contributors determine what they would like to work on during the release cycle, including proposals for changes in default applications. Anybody can add items to the list. Settling on the goals in advance will make planning, focusing and estimating the likelihood for the features to be implemented easier.
id: Selama tahap bertukar pikiran kontributor menentukan apa yang akan mereka kerjakan selama siklus rilis, termasuk proposal untuk perubahan dalam aplikasi standar. Siapa saja dapat menambahkan item ke daftar. Menentukan tujuan di muka akan membuat perencanaan, pemfokusan, dan memperkirakan kemungkinan fitur-fitur untuk diimplementasikan lebih mudah.

source: After the brainstorming is over and before or on the Feature Definition Freeze day, the Xubuntu team will approve or reject the proposed blueprints. Any items with no assignee or rationale will be automatically rejected, but having them will not guarantee that the blueprint is approved. Other criteria include, but are not limited to: likelihood of getting the feature implemented, maintenance weight in the future, possible stability issues, influence on other blueprints, et cetera. The approved blueprints compose the roadmap for the release being developed.
id: Setelah tukar pikiran selesai dan sebelum atau pada Hari Pembekuan Fitur Definisi, tim Xubuntu akan menyetujui atau menolak cetak biru yang diusulkan. Barang apa pun tanpa penerima hak atau alasan akan ditolak secara otomatis, tetapi memilikinya tidak akan menjamin bahwa cetak biru disetujui. Kriteria lain termasuk, tetapi tidak terbatas pada: kemungkinan penerapan fitur, bobot pemeliharaan di masa depan, kemungkinan masalah stabilitas, pengaruh pada cetak biru lainnya, dan lain-lain. Cetak biru yang disetujui menyusun peta jalan untuk rilis yang sedang dikembangkan.
