Repository: Xubuntu/xubuntu-docs
Catalog: contributor-docs/po/*.po
Languages: id

source: <emphasis>Tags should not be translated.</emphasis> Where you see a tag in the source string (for example: "&lt;xref linkend="&amp;xubuntu-web;" /&gt;"), the tag and anything inside the tag itself should not be translated. It is very important to copy and paste these tags exactly as they appear in the source string. Note: The exception to this is where a tag contains a URL that has an equivalent, translated version. In those cases the translator should use discretion about whether to localise the URL.
id: <emphasis>Tag tidak boleh diterjemahkan.</emphasis> Di mana Anda melihat tag di string sumber (misalnya: "&lt;xref linkend="&amp;xubuntu-web;" /&gt;"), tag dan apa pun di dalam tag itu sendiri tidak boleh diterjemahkan. Sangat penting untuk menyalin dan rekatkan tag ini persis seperti yang ditampilkan dalam string sumber. Catatan: Pengecualian untuk ini adalah di mana tag berisi URL yang memiliki versi terjemahan yang setara. Dalam kasus tersebut, penerjemah harus menggunakan kebijaksanaan tentang apakah akan melokalisasi URL.

source: <emphasis>Entities should not be translated.</emphasis> Where you see a phrase expressed like "&amp;gt;" or "&amp;xubuntu-web;", do not change this.
id: <emphasis>Entitas tidak boleh diterjemahkan.</emphasis> Di mana Anda melihat frasa yang diekspresikan seperti "&amp;gt;" or "&amp;xubuntu-web;", jangan ubah ini.

source: <emphasis>Always maintain the order of tags.</emphasis> When you see different tags nested inside each other (for example: "&lt;menuchoice&gt;&lt;guimenu&gt;System&lt;/guimenu&gt;&lt;guimenuitem&gt;Administration&lt;/guimenuitem&gt;&lt;guimenuitem&gt;Users and Groups&lt;/guimenuitem&gt;&lt;/menuchoice&gt;"), you must always preserve that order carefully - copying and pasting from the source language (English) is the best way to ensure that you do this correctly.
id: <emphasis>Selalu pertahankan urutan tag.</emphasis> Ketika Anda melihat tag yang berbeda bersarang di dalam satu sama lain (misalnya: "&lt;menuchoice&gt;&lt;guimenu&gt;System&lt;/guimenu&gt;&lt;guimenuitem&gt;Administration&lt;/guimenuitem&gt;&lt;guimenuitem&gt;Users and Groups&lt;/guimenuitem&gt;&lt;/menuchoice&gt;"), Anda harus selalu menjaga urutan itu dengan hati-hati - menyalin dan menempel dari bahasa sumber (Bahasa Inggris) adalah cara terbaik untuk memastikan bahwa Anda melakukan ini dengan benar.

source: Different programming languages and software might have different variable syntaxes; make sure you are familiar with the appropriate software variable syntax when translating. More information on this can often be found in the translation string comment.
id: Bahasa pemrograman dan perangkat lunak yang berbeda mungkin memiliki sintaks variabel yang berbeda; pastikan Anda terbiasa dengan sintaks variabel perangkat lunak yang sesuai saat menerjemahkan. Informasi lebih lanjut tentang ini sering dapat ditemukan di komentar string terjemahan.

source: Follow good and existing conventions
id: Ikuti konvensi yang baik dan yang sudah ada

source: <emphasis>Use application and label names found in the (graphical) UI.</emphasis> When translating UI labels and application names, use the term or name that is used on the graphical UI. This makes it easier for the user to follow the instructions. Running the system in both the translation target language and English can help with this.
id: <emphasis>Gunakan nama aplikasi dan label yang ditemukan di UI (grafis).</emphasis> Saat menerjemahkan label UI dan nama aplikasi, gunakan istilah atau nama yang digunakan pada UI grafis. Ini membuatnya lebih mudah bagi pengguna untuk mengikuti instruksi. Menjalankan sistem dalam bahasa target terjemahan dan bahasa Inggris dapat membantu dalam hal ini.

source: <emphasis>Do not change the amount of spacing.</emphasis> When translating, do not change the amount of spacing inside our outside tags. Keeping the spacing as it is makes the technical reviewing of the translation easier.
id: <emphasis> Jangan ubah jumlah spasi.</emphasis> Saat menerjemahkan, jangan ubah jumlah spasi di dalam tag luar kami. Menjaga jarak seperti itu membuat peninjauan teknis terjemahan menjadi lebih mudah.

source: <emphasis>Do not change the type of quotes used inside the tags.</emphasis> The double quotes ( " ) doesn't have the same significance in a DocBook, XHTML or XML tag as the guillemets ( « » ). Using different kind of quotes can potentially develop into validity problems as well.
id: <emphasis>Jangan ubah jenis kutipan yang digunakan di dalam tag.</emphasis> Kutipan ganda (") tidak memiliki arti yang sama dalam tag DocBook, XHTML, atau XML dengan tag guillemets (« »). Menggunakan berbagai jenis kutipan berpotensi berkembang menjadi masalah validitas juga.

source: <emphasis>Never change a tag to another.</emphasis> If you think a tag in the source is invalid or not semantic, file a bug against the package itself instead of changing it in the translation.
id: <emphasis>Jangan pernah mengubah tag ke tag lain.</emphasis> Jika menurut Anda tag dalam sumber tidak valid atau tidak semantik, ajukan bug pada paket itu sendiri alih-alih mengubahnya dalam terjemahan.

source: Tasks
id: Tugas

source: User documentation
id: Dokumentasi pengguna

source: The documentation team works with the developers to ensure any new features that are part of the core functionality of the operating system are covered in the documentation. In addition, the documentation team makes sure features highlighted in the installer slideshow or any other marketing material are appropriately documented. When completely new sections are written, the documentation team makes sure the Xubuntu team has a chance to review and propose changes and fixes to the new sections. When any documented features are removed or changed, the team makes sure the documentation does not refer to any removed functionality.
id: Tim dokumentasi bekerja dengan pengembang untuk memastikan semua fitur baru yang merupakan bagian dari fungsionalitas inti sistem operasi tercakup dalam dokumentasi. Selain itu, tim dokumentasi memastikan fitur yang disorot dalam tayangan slide pemasang atau materi pemasaran lainnya didokumentasikan dengan tepat. Ketika bagian yang sepenuhnya baru ditulis, tim dokumentasi memastikan tim Xubuntu memiliki kesempatan untuk meninjau dan mengusulkan perubahan dan perbaikan ke bagian yang baru. Ketika semua fitur yang terdokumentasi dihapus atau diubah, tim memastikan dokumentasi tidak merujuk ke fungsionalitas yang dihapus.

source: The team should be aware of changes to new releases, particularly on LTS releases and potential SRUs, as those might affect documentation.
id: Tim harus menyadari perubahan pada rilis baru, terutama pada rilis LTS dan potensi SRU, karena hal itu dapat mempengaruhi dokumentasi.

source: The documentation team is responsible for making sure the documentation is updated before the Documentation String Freeze prior to uploading. Once the upload is done, the team coordinates translation efforts and makes sure the documentation gets another upload before the Translation Freeze. The team should also request the <ulink url="http://docs.xubuntu.org/">online documentation</ulink> to be updated shortly before the release.
id: Tim dokumentasi bertanggung jawab untuk memastikan dokumentasi diperbarui sebelum String Dokumentasi Freeze sebelum diunggah. Setelah pengunggahan selesai, tim mengoordinasikan upaya penerjemahan dan memastikan dokumentasi mendapatkan pengunggahan lain sebelum Terjemahan Beku. Tim juga harus meminta <ulink url="http://docs.xubuntu.org/">dokumentasi online</ulink> untuk diperbarui sesaat sebelum rilis.

source: The documentation team should also look to improve and expand the existing documentation, especially during the development cycles when most uploads are done for maintenance purposes. The team should involve the community in these efforts the best way they see fit.
id: Tim dokumentasi juga harus berupaya meningkatkan dan memperluas dokumentasi yang ada, terutama selama siklus pengembangan ketika sebagian besar unggahan dilakukan untuk tujuan pemeliharaan. Tim harus melibatkan masyarakat dalam upaya ini dengan cara terbaik yang mereka inginkan.

source: Contributor documentation
id: Dokumentasi kontributor

source: The documentation team lead the efforts to write the contributor documentation. While the various subteams are responsible for their own sections, the documentation team should help the teams to get their content pushed to the main branch and where needed, help contributors to format the content in the DocBook markup.
id: Tim dokumentasi memimpin upaya untuk menulis dokumentasi kontributor. Sementara berbagai subteam bertanggung jawab atas bagian mereka sendiri, tim dokumentasi harus membantu tim untuk mendorong konten mereka ke cabang utama dan jika diperlukan, membantu kontributor untuk memformat konten dalam markup DocBook.

source: The <ulink url="http://docs.xubuntu.org/contributors/">online contributor documentation</ulink> should be kept updated especially when major changes are made; the documentation team should request an update whenever they see fit.
id: <ulink url="http://docs.xubuntu.org/contributors/"> dokumentasi kontributor online</ulink> harus terus diperbarui terutama ketika perubahan besar dibuat; tim dokumentasi harus meminta pembaruan kapan pun mereka mau.

source: Other tasks
id: Tugas lainnya

source: In addition to the above, the documentation team is strongly encouraged to do the following:
id: Selain hal di atas, tim dokumentasi sangat dianjurkan untuk melakukan hal berikut:

source: Work with the Quality Assurance team to write and maintain testcases
id: Bekerja dengan tim Jaminan Kualitas untuk menulis dan memelihara kasus uji

source: Work with the website team to improve the website content and write FAQ or other documentation related articles
id: Bekerja dengan tim situs web untuk meningkatkan konten situs web dan menulis FAQ atau artikel terkait dokumentasi lainnya

source: Work with the marketing team on various projects, like flyers
id: Bekerja dengan tim pemasaran di berbagai proyek, seperti selebaran

source: Xubuntu packageset
id: Set Paket Xubuntu

source: The Xubuntu team maintains a subset of packages in the Ubuntu archive. The Xubuntu packageset for the current development release can be found listed at the packageset <ulink url="http://people.canonical.com/~ubuntu-archive/packagesets/">archive</ulink>.
id: Tim Xubuntu mengelola subset paket dalam arsip Ubuntu. Paket Xubuntu untuk rilis pengembangan saat ini dapat ditemukan terdaftar di paket set <ulink url="http://people.canonical.com/~ubuntu-archive/packagesets/">arsip</ulink>.

source: Development PPAs
id: Pengembangan PPA

source: The Xubuntu developers use several PPAs (personal package archives) for staging, testing and previewing new packages and package versions. These PPAs can be found under the <ulink url="https://launchpad.net/~xubuntu-dev">Xubuntu Developers</ulink> page on Launchpad.
id: Pengembang Xubuntu menggunakan beberapa PPA (arsip paket pribadi) untuk menentukan stadium, menguji dan melihat dulu paket dan versi paket baru. PPA ini dapat ditemukan di halaman <ulink url="https://launchpad.net/~xubuntu-dev">halaman Xubuntu Developers</ulink> di Launchpad.

source: Currently, the official PPAs for development use are:
id: Saat ini, AKP resmi untuk penggunaan pembangunan adalah:

source: Description
id: Deskripsi

source: Xubuntu Staging
id: Tahapan Xubuntu

source: A staging PPA for Xubuntu. The packages and package versions in this PPA are being prepared for inclusion in Xubuntu. The packages are uploaded for the convenience of people testing these new package versions and features. Some of them are daily builds used in testing.
id: PPA bertahap untuk Xubuntu. Paket dan versi paket dalam PPA ini sedang dipersiapkan untuk dimasukkan dalam Xubuntu. Paket diunggah untuk kenyamanan orang yang menguji versi dan fitur paket baru ini. Beberapa dari mereka adalah build harian yang digunakan dalam pengujian.

source: Xubuntu Daily Builds
id: Pembangunan Harian Xubuntu

source: Git/Bzr daily builds for packages related to Xubuntu and/or Xfce4.
id: Git/Bzr setiap hari dibuat untuk paket yang terkait dengan Xubuntu dan/atau Xfce4.

source: Xubuntu Extras
id: Xubuntu Extra

source: A preview PPA for Xubuntu. The packages in this PPA are considered for inclusion in the Ubuntu repositories and/or Xubuntu at a later time. The packages are uploaded for the convenience of people willing to preview the new features.
id: PPA pratinjau untuk Xubuntu. Paket-paket dalam PPA ini dipertimbangkan untuk dimasukkan dalam repositori Ubuntu dan/atau Xubuntu di lain waktu. Paket-paket tersebut diunggah untuk kenyamanan orang-orang yang ingin melihat fitur baru.

source: Common Reference
id: Referensi Umum

source: Using Bazaar (Bzr)
id: Menggunakan Bazaar (Bzr)

source: Bazaar (commonly referred to as Bzr) is the version control system primarily used in Xubuntu development.
id: Bazaar (biasanya disebut sebagai Bzr) adalah sistem kontrol versi yang terutama digunakan dalam pengembangan Xubuntu.

source: Setting up Bzr
id: Mengatur Bzr

source: To set up Bzr, do the following:
id: Untuk mengatur Bzr, lakukan hal berikut:

source: To make sure Bzr is installed on your system, run <userinput>sudo apt-get install bzr</userinput>
id: Untuk memastikan Bzr diinstal pada sistem Anda, jalankan <userinput>sudo apt-get install bzr</userinput>

source: To set up your personal information for Bzr to use, run <userinput>bzr whoami "John Doe &lt;john.doe@gmail.com&gt;"</userinput>
id: Untuk mengatur informasi pribadi Anda agar Bzr dapat digunakan, jalankan <userinput>bzr whoami "John Doe &lt;john.doe@gmail.com&gt;"</userinput>

source: Getting and updating Bzr branches
id: Mendapatkan dan memperbarui cabang Bzr

source: After you have set up Bzr, you can get a local copy of a branch by running <userinput>bzr branch LOCATION</userinput>. This will create a directory for the branch.
id: Setelah mengatur Bzr, Anda bisa mendapatkan salinan lokal cabang dengan menjalankan <userinput>bzr branch LOCATION</userinput>. Ini akan membuat direktori untuk cabang.

source: To make sure your local copy is up to date, run <userinput>bzr pull</userinput> inside the branch directory.
id: Untuk memastikan salinan lokal Anda mutakhir, jalankan <userinput>bzr pull</userinput> di dalam direktori cabang.

source: Pushing to Bzr branches
id: Mendorong ke cabang Bzr

source: When you have worked on your changes and want to push them to a remote branch, do the following in the local branch:
id: Ketika Anda telah mengerjakan perubahan Anda dan ingin mendorongnya ke cabang remote, lakukan hal berikut di cabang lokal:

source: To rename or move files, run <userinput>bzr mv OLD NEW</userinput>. This helps to keep the resulting diff meaningful, and also works after the fact.
id: Untuk mengganti nama atau memindahkan file, jalankan <userinput>bzr mv OLD NEW</userinput>. Ini membantu menjaga perbedaan yang dihasilkan bermakna, dan juga berfungsi setelah fakta.

source: If you have added files, run <userinput>bzr add .</userinput> in the branch root. This starts tracking any files in the branch that are currently unknown.
id: Jika Anda telah menambahkan file, jalankan <userinput>bzr add .</userinput> di root cabang. Ini mulai melacak semua file di cabang yang saat ini tidak dikenal.

source: If you have removed files, run <userinput>bzr remove</userinput>. In most cases, this should automatically stop tracking files that are no longer in the branch.
id: Jika Anda telah menghapus file, jalankan <userinput>bzr remove</userinput>. Dalam kebanyakan kasus, ini harus secara otomatis berhenti melacak file yang tidak lagi ada di cabang.

source: To check the status of the branch, run <userinput>bzr status</userinput>.
id: Untuk memeriksa status cabang, jalankan <userinput>bzr status</userinput>.

source: Commit your changes by running <userinput>bzr commit</userinput>. This will open a text editor to enter the commit message.
id: Komit perubahan Anda dengan menjalankan <userinput>bzr commit</userinput>. Ini akan membuka editor teks untuk memasukkan pesan komit.

source: After you have done one or more commits, run <userinput>bzr push LOCATION</userinput> to push your changes to a remote branch.
id: Setelah Anda melakukan satu atau lebih komit, jalankan <userinput>bzr push LOCATION</userinput> untuk mendorong perubahan Anda ke cabang jarak jauh.

source: The commit message should summarize all the changes you have done after the last commit. You can specify it directly by using <literal>-m MESSAGE</literal>, and link a bug report to the commit by using <literal>--fixes lp:BUGNO</literal>.
id: Pesan komit harus merangkum semua perubahan yang telah Anda lakukan setelah komit terakhir. Anda dapat menentukannya secara langsung dengan menggunakan <literal>-m MESSAGE</literal>, dan menautkan laporan bug ke komit dengan menggunakan <literal>--fixes lp:BUGNO</literal>.

source: When you are working on a branch and are making several changes that aren't related to each other, it is recommended that you do several commits. This helps to keep the commit log clean and makes it easier to find any issues that certain changes may have introduced.
id: Saat Anda mengerjakan cabang dan membuat beberapa perubahan yang tidak terkait satu sama lain, disarankan agar Anda melakukan beberapa komitmen. Ini membantu menjaga log komit tetap bersih dan membuatnya lebih mudah untuk menemukan masalah yang mungkin telah diperkenalkan oleh perubahan tertentu.

source: When you push to a remote branch the first time, you will need to specify the branch location. In most cases, it will follow the format <literal><placeholder-1/>lp:~username/projectname/branchname</literal>. This pushes your code to a personal remote branch. On subsequent pushes, you can omit the branch location, as Bzr will have saved your previous push location in the local branch configuration.
id: Saat Anda mendorong ke cabang jarak jauh pertama kali, Anda harus menentukan lokasi cabang. Dalam kebanyakan kasus, ini akan mengikuti format <literal><placeholder-1/>lp:~username/projectname/branchname</literal>. Ini mendorong kode Anda ke cabang jarak jauh pribadi. Pada dorongan berikutnya, Anda dapat menghilangkan lokasi cabang, karena Bzr akan menyimpan lokasi push Anda sebelumnya dalam konfigurasi cabang lokal.

source: Submitting merge proposals
id: Menyerahkan proposal penggabungan

source: Once you have pushed your changes to a personal branch, you might want to propose them to be merged into the main branch.
id: Setelah Anda mendorong perubahan Anda ke cabang pribadi, Anda mungkin ingin mengusulkannya untuk digabung ke cabang utama.

source: To do a merge proposal (often referred to as MP) via web browser, start by opening the Launchpad page of your branch. You can find it by going to <ulink url="https://code.launchpad.net/people/+me">your Launchpad branches</ulink> page and clicking on the branch in question. Now, click on <guilabel>Propose for merging</guilabel>. This will open a page that asks for some details on the merge proposal you are about to do.
id: Untuk melakukan proposal penggabungan (sering disebut MP) melalui browser web, mulailah dengan membuka halaman Launchpad di cabang Anda. Anda dapat menemukannya dengan membuka <ulink url="https://code.launchpad.net/people/+me">halaman cabang Launchpad Anda </ulink> dan mengklik cabang yang dimaksud. Sekarang, klik pada <guilabel> Usulkan untuk menggabungkan </guilabel>. Ini akan membuka halaman yang meminta beberapa detail pada proposal penggabungan yang akan Anda lakukan.

source: The <guilabel>Target Branch</guilabel> is usually set correctly by default, change this only if you know it is wrong. If you have been told to add a specific <guilabel>Reviewer</guilabel>, add that reviewer to the appropriate field. Enter a <guilabel>Description</guilabel> of your proposed change as well. If in doubt about any of the options, ask the requested reviewer, or if one isn't specified, in the IRC channel.
id: <guilabel>Target Branch</guilabel> biasanya diset dengan benar secara default, ubah ini hanya jika Anda tahu itu salah. Jika Anda telah diberitahu untuk menambahkan resensi <guilabel>Reviewer</guilabel>, tambahkan resensi itu ke bidang yang sesuai. Masukkan <guilabel> Description</guilabel> dari perubahan yang Anda usulkan juga. Jika ragu tentang salah satu opsi, tanyakan resensi yang diminta, atau jika tidak ditentukan, di saluran IRC.

source: Finally, click on <guibutton>Propose Merge</guibutton>. This submits your merge proposal and the target branch's owner as well as the specified reviewers will be sent a mail. If they need further information or want you to work further on the branch, they will comment on the merge proposal. You will be sent a mail any time an action is taken on the merge proposal, including when it's approved and merged into the main branch.
id: Terakhir, klik pada <guibutton>Propose Merge</guibutton>. Ini mengirimkan proposal penggabungan Anda dan pemilik cabang target serta pengulas yang ditentukan akan dikirimi surat. Jika mereka membutuhkan informasi lebih lanjut atau ingin Anda bekerja lebih jauh di cabang, mereka akan mengomentari proposal penggabungan. Anda akan dikirimi surat kapan saja suatu tindakan diambil pada proposal penggabungan, termasuk ketika itu disetujui dan digabung ke cabang utama.

source: To do a merge proposal from the command line, using both the remembered submit branch (defaults to the parent branch) and the default reviewer team for that branch, run <userinput>bzr lp-propose-merge</userinput>. This will open a text editor to enter the description of your proposed change. You can override the default reviewer by using <literal>--review NAME</literal> one or more times, and link a bug report to the merge proposal by using <literal>--fixes lp:BUGNO</literal>.
id: Untuk melakukan proposal penggabungan dari baris perintah, menggunakan cabang kirim yang diingat (default ke cabang induk) dan tim peninjau default untuk cabang itu, jalankan <userinput>bzr lp-propose-merge</userinput>. Ini akan membuka editor teks untuk memasukkan deskripsi perubahan yang Anda usulkan. Anda dapat mengganti resensi default dengan menggunakan <literal>--review NAME</literal> satu kali atau lebih, dan menautkan laporan bug ke proposal penggabungan dengan menggunakan <literal>--fixes lp:BUGNO</literal>.

source: Using Git
id: Menggunakan Git

source: Git is the version control system used in Xfce development.
id: Git adalah sistem kontrol versi yang digunakan dalam pengembangan Xfce.

source: One major difference between Git and Bazaar to note is that, in Bazaar you usually deal only with branches, while in Git you have to differentiate between branches and repositories, which can hold multiple branches. This is also reflected by the various commands you use. Another is that Git doesn't automatically stage your changes for commit, you have to tell it to do so.
id: Satu perbedaan utama antara Git dan Bazaar untuk diperhatikan adalah bahwa, di Bazaar Anda biasanya hanya berurusan dengan cabang, sedangkan di Git Anda harus membedakan antara cabang dan repositori, yang dapat menampung banyak cabang. Ini juga tercermin dari berbagai perintah yang Anda gunakan. Lain adalah bahwa Git tidak secara otomatis membuat perubahan untuk komit, Anda harus mengatakannya untuk melakukannya.

source: Setting up Git
id: Mengatur Git

source: To set up Git, do the following:
id: Untuk mengatur Git, lakukan hal berikut:

source: To make sure Git is installed on your system, run:
id: Untuk memastikan Git telah terinstal pada sistem anda, jalankan:

source: To set up your personal information for Git to use, run:
id: Untuk mengatur informasi pribadi Anda agar Git dapat digunakan, jalankan:
