Repository: Xubuntu/xubuntu-docs
Catalog: contributor-docs/po/*.po
Languages: id

source: When the intention is that package testing will take place during the cycle, package testcases required during the cycle are still correct.
id: Ketika maksudnya adalah bahwa pengujian paket akan berlangsung selama siklus, kasus uji paket yang diperlukan selama siklus masih benar.

source: The testsuites on the Package Tracker make sense for what we intend to test during the cycle. Differences between regular and LTS releases are often, but not always, needed.
id: Testuites pada Pelacak Paket masuk akal untuk apa yang ingin kami uji selama siklus. Perbedaan antara rilis reguler dan LTS sering, tetapi tidak selalu dibutuhkan.

source: Scheduling of ISO, and when appropriate Package, testing should take place amongst the QA team.
id: Penjadwalan ISO, dan bila sesuai Paket, pengujian harus dilakukan di antara tim QA.

source: When there are changes to a package we test, following for example a bug fix, a further check of the testcase involved should take place. Further testing calls for that package should be made to check for regression during the cycle.
id: Ketika ada perubahan pada paket yang kami uji, mengikuti misalnya perbaikan bug, pemeriksaan lebih lanjut dari testcase yang terlibat harus dilakukan. Pengujian lebih lanjut memerlukan paket yang harus dilakukan untuk memeriksa regresi selama siklus.

source: When a package during test constantly fails, or bug reports indicate a failure in a package for something not tested, the testcase for that package can be disabled temporarily. The QA Lead is responsible for ensuring tests are both disabled and re-enabled when appropriate.
id: Ketika sebuah paket selama pengujian terus-menerus gagal, atau laporan bug mengindikasikan kegagalan dalam suatu paket untuk sesuatu yang tidak diuji, testcase untuk paket itu dapat dinonaktifkan sementara. Pimpinan QA bertanggung jawab untuk memastikan pengujian dinonaktifkan dan diaktifkan kembali jika perlu.

source: Xubuntu ISOs are built and added to the tracker at approximately 02:00 UTC. This time can be changed by amending our build times on the <ulink url="http://bazaar.launchpad.net/~ubuntu-cdimage/ubuntu-cdimage/mainline/files/head:/etc/">ubuntu-cdimage crontab</ulink> and proposing the change.
id: ISO Xubuntu dibangun dan ditambahkan ke pelacak sekitar pukul 02:00 UTC. Waktu ini dapat diubah dengan mengubah waktu pembuatan kami di <ulink url="http://bazaar.launchpad.net/~ubuntu-cdimage/ubuntu-cdimage/mainline/files/head:/etc/"> ubuntu-cdimage crontab </ulink> dan usulkan perubahan.

source: Working with testcases
id: Bekerja dengan percobaan kasus

source: Information on the basic method of working with testcases can be found at the Ubuntu QA Team <ulink url="https://wiki.ubuntu.com/QATeam/ContributingTestcases/Manual">Manual Testcases</ulink> page.
id: Informasi tentang metode dasar bekerja dengan testcases dapat ditemukan di Tim QA Ubuntu <ulink url="https://wiki.ubuntu.com/QATeam/ContributingTestcases/Manual"> halaman Manual Kasus Cobaan </ulink>.

source: <emphasis>We</emphasis> are only concerned with a specific set of tasks: grabbing the branch, making edits and then pushing the changes we need to the main branch. We have people in the Testcase Admin team for the LP Testcases, in addition any member of our Release Team can edit the tracker, this helps ensure that changes are moved through to the trackers quickly.
id: <emphasis> Kami </emphasis> hanya memusatkan perhatian pada serangkaian tugas khusus: meraih cabang, menyunting, lalu mendorong perubahan yang kami butuhkan ke cabang utama. Kami memiliki orang-orang di tim Admin Testcase untuk LP Testcases, selain itu setiap anggota Tim Rilis kami dapat menyunting pelacak, ini membantu memastikan bahwa perubahan dipindahkan melalui pelacak dengan cepat.

source: To edit a testcase:
id: Untuk menyunting percobaan kasus:

source: <ulink url="https://bugs.launchpad.net/ubuntu-manual-tests/+filebug">Report</ulink> the required change as a bug against the testcase project
id: <ulink url="https://bugs.launchpad.net/ubuntu-manual-tests/+filebug"> Laporkan </ulink> perubahan yang diperlukan sebagai bug terhadap proyek kasus cobaan

source: Assign yourself to the bug
id: Tetapkan diri Anda ke bug

source: Create a local branch: <userinput>bzr branch lp:ubuntu-manual-tests</userinput>
id: Buat cabang lokal: <userinput> bzr branch lp: ubuntu-manual-tes </userinput>

source: Make changes to the testcase in your local branch
id: Buat perubahan pada kasus cobaan di cabang lokal Anda

source: Commit the changes: <userinput>bzr commit -m "Fix LP bug #BUGNO."</userinput>
id: Lakukan perubahan: <userinput> bzr commit -m "Fix bug LP #BUGNO."</userinput>

source: Push to a personal remote branch: <userinput>bzr push lp:~username/ubuntu-manual-tests/bug-BUGNO</userinput>
id: Dorong ke cabang jarak jauh pribadi: <userinput> bzr push lp:~username/ubuntu-manual-test/bug-BUGNO</userinput>

source: Once pushed to a personal remote branch, propose the change for merging - <xref linkend="bzr-merge-proposal"/>.
id: Setelah didorong ke cabang jarak jauh pribadi, usulkan perubahan untuk menggabungkan - <xref linkend="bzr-merge-proposal"/>.

source: Respond to any requests for changes when asked by the Testcase Admins in order to get the required change through in a timely manner.
id: Menanggapi setiap permintaan untuk perubahan ketika diminta oleh Admin Kasus Cobaan untuk mendapatkan perubahan yang diperlukan melalui tepat waktu.

source: Communicating with Testers and Users
id: Berkomunikasi dengan Penguji dan Pengguna

source: While we have two sets of people in the community that we contact about required testing, Testers will get regular contact from us, but we should only, in general, call on Users at later stages.
id: Meskipun kami memiliki dua set orang di komunitas yang kami hubungi tentang pengujian yang diperlukan, Penguji akan mendapatkan kontak rutin dari kami, tetapi kami hanya akan, secara umum, memanggil Pengguna pada tahap selanjutnya.

source: The QA Lead will be an administrator on the Testers Launchpad page and can contact those users via LP. Copies of testing calls sent to the devel mailing list should go to this group each time.
id: Pimpinan QA akan menjadi administrator pada halaman Penguji Launchpad dan dapat menghubungi pengguna tersebut melalui LP. Salinan panggilan pengujian yang dikirim ke milis devel harus pergi ke grup ini setiap kali.

source: Any member of the QA team can:
id: Setiap anggota tim QA dapat:

source: Mail the devel list with a testing call
id: Mengirimkan daftar devel dengan panggilan pengujian

source: Just prior to an upcoming ISO testing week call, warn on the devel list
id: Tepat sebelum panggilan minggu pengujian ISO mendatang, peringatkan pada daftar devel

source: Make an ISO testing week call
id: Melakukan panggilan minggu pengujian ISO

source: Xubuntu Users will be contacted for ISO testing at the Final Beta ISO Milestone.
id: Pengguna Xubuntu akan dihubungi untuk pengujian ISO di Final Beta ISO Milestone.

source: Release Responsibilities
id: Melepaskan Tanggung Jawab

source: Much of the responsibility for the QA team at any release lies with the QA Lead.
id: Sebagian besar tanggung jawab untuk tim QA pada rilis apa pun ada pada Pimpinan QA.

source: However, <emphasis>any</emphasis> member of the QA team can:
id: Namun, <emphasis> sembarang anggota </emphasis> dari tim QA dapat:

source: Work with the testing wiki <ulink url="https://wiki.xubuntu.org/releases/18.10/release-notes">Release Note</ulink>
id: Bekerja dengan wiki pengujian <ulink url="https://wiki.xubuntu.org/releases/18.10/release-notes"> Catatan Rilis</ulink>

source: Check status of bugs listed on the above draft
id: Periksa status bug yang tercantum pada konsep di atas

source: Check status of work items on the QA blueprint, marking as appropriate
id: Periksa status item kerja pada cetak biru QA, tandai sesuai

source: Post Release Tasks
id: Posting Tugas Rilis

source: Following release, there are a few tasks that need to be done before the next release cycle begins.
id: Setelah rilis, ada beberapa tugas yang perlu dilakukan sebelum siklus rilis berikutnya dimulai.

source: QA Lead should set up the blueprints for both the QA team and the Bugs that the whole team uses
id: Pimpinan QA harus menyiapkan cetak biru untuk tim QA dan Bug yang digunakan seluruh tim

source: Check that the draft Release Note is up to date
id: Periksa bahwa rancangan Catatan Rilis sdah terbaru

source: Package and ISO Testing
id: Paket dan Pengujian ISO

source: ISOs
id: ISO

source: In general, links for specific ISOs for daily or milestone use can be found at the <ulink url="http://iso.qa.ubuntu.com/">ISO Tracker</ulink>. A link exists for the <ulink url="http://cdimage.ubuntu.com/xubuntu/daily-live/current/">current</ulink> development daily ISO. This can be useful, especially when setting up methods to download your testing ISO, such as with <ulink url="https://help.ubuntu.com/community/ZsyncCdImage">zsync</ulink>
id: Secara umum, tautan untuk ISO tertentu untuk penggunaan harian atau milestone dapat ditemukan di <ulink url="http://iso.qa.ubuntu.com/"> Pelacak ISO </ulink>. Ada tautan untuk <ulink url="http://cdimage.ubuntu.com/xubuntu/daily-live/current/"> ISO harian yang sedang berkembang. Ini bisa bermanfaat, terutama ketika mengatur metode untuk mengunduh ISO pengujian Anda, seperti dengan <ulink url="https://help.ubuntu.com/community/ZsyncCdImage"> zsync </ulink>

source: You can find the last known boot and installation status of our ISOs at <ulink url="http://dev.xubuntu.org/#tab-qa">QA Status</ulink> of the development status tracker
id: Anda dapat menemukan boot dan status pemasangan ISO terakhir yang diketahui di <ulink url="http://dev.xubuntu.org/#tab-qa"> Status QA </ulink> pelacak status pengembangan

source: Exploratory Testing
id: Pengujian Eksplorasi

source: In addition to testing the images and software with predefined testing actions (static testing), community members can take part in exploratory testing as well.
id: Selain menguji gambar dan perangkat lunak dengan tindakan pengujian yang telah ditentukan sebelumnya (pengujian statis), anggota masyarakat juga dapat mengambil bagian dalam pengujian eksplorasi.

source: In essence, exploratory testing means running the development release and doing your daily tasks with the system and finally, filing bugs when you find them. This allows Xubuntu to get a much larger spread of testing than is possible with predefined tests.
id: Intinya, pengujian eksplorasi berarti menjalankan rilis pengembangan dan melakukan tugas-tugas harian Anda dengan sistem dan akhirnya, melaporkan bug ketika Anda menemukannya. Ini memungkinkan Xubuntu untuk mendapatkan pengujian yang jauh lebih besar daripada yang mungkin dilakukan dengan tes yang telah ditentukan.

source: A useful way to deal with this is dual (or multiple) boots. By dual (or multiple) booting you can ensure you are able to access at all times a working version while testing the development system. In this way you can do as much work in the development release as is practical – all the while watching for bugs and regressions in the development release.
id: Cara yang berguna untuk menangani ini adalah boot ganda (atau ganda). Dengan dual (atau multiple) booting Anda dapat memastikan Anda dapat mengakses versi yang berfungsi setiap saat saat menguji sistem pengembangan. Dengan cara ini Anda dapat melakukan sebanyak mungkin pekerjaan dalam rilis pengembangan yang praktis - sambil memperhatikan bug dan regresi dalam rilis pengembangan.

source: When dual (or multiple booting) it can be helpful to install the bootloader to specific partitions, a simple run-through on addressing this can be found at <ulink url="https://wiki.xubuntu.org/qa/fine_tuning">Manual Partitions and Bootloader location</ulink>.
id: Ketika dual (atau multi-booting) akan sangat membantu untuk menginstal bootloader ke partisi tertentu, langkah-langkah sederhana untuk mengatasi ini dapat ditemukan di <ulink url="https://wiki.xubuntu.org/qa/fine_tuning" > Partisi Manual dan lokasi Bootloader</ulink>.

source: Issues which the development team are keen to address include, in addition to normally reported issues, usability bugs, missing icons, inconsistent functionality.
id: Masalah yang ingin ditangani oleh tim pengembangan termasuk, selain masalah yang biasanya dilaporkan, bug kegunaan, ikon yang hilang, fungsionalitas yang tidak konsisten.

source: Using Development PPAs
id: Menggunakan PPA Pengembangan

source: We have 3 PPAs which we use regularly to test packages. These are:
id: Kami memiliki 3 PPA yang kami gunakan secara teratur untuk menguji paket. Ini adalah:

source: <ulink url="https://launchpad.net/~shimmerproject/+archive/ubuntu/daily">Shimmer Themes</ulink> for daily builds of the Shimmer Project’s projects
id: <ulink url="https://launchpad.net/~shimmerproject/+archive/ubuntu/daily"> Tema Shimmer</ulink> untuk pembuatan harian proyek Proyek Shimmer

source: <ulink url="https://launchpad.net/~xubuntu-dev/+archive/ubuntu/ppa">Xubuntu daily builds</ulink> for daily Git and Bzr builds for packages related to Xubuntu and/or Xfce4
id: <ulink url="https://launchpad.net/~xubuntu-dev/+archive/ubuntu/ppa"> build harian Xubuntu</ulink> untuk build Git dan Bzr harian untuk paket yang terkait dengan Xubuntu dan/atau Xfce4

source: <ulink url="https://launchpad.net/~xubuntu-dev/+archive/ubuntu/experimental">Xubuntu QA Experimental</ulink> for packages and package versions that are being prepared for inclusion in Xubuntu, uploaded for the convenience of people testing these new package versions and features in an otherwise stable environment
id: <ulink url="https://launchpad.net/~xubuntu-dev/+archive/ubuntu/experimental"> Eksperimental QA Xubuntu</ulink> untuk paket dan versi paket yang sedang dipersiapkan untuk dimasukkan dalam Xubuntu, diunggah untuk kenyamanan orang menguji versi paket dan fitur baru ini di lingkungan yang stabil

source: <ulink url="https://launchpad.net/~xubuntu-dev/+archive/ubuntu/staging">Xubuntu QA Staging</ulink> for testing of packages in released and current Xubuntu versions
id: <ulink url="https://launchpad.net/~xubuntu-dev/+archive/ubuntu/staging"> Pementasan QA Xubuntu</ulink> untuk menguji paket dalam versi Xubuntu yang dirilis dan saat ini

source: At times the development team use other PPAs to test specific packages. Details of these will be made known to testers when appropriate
id: Terkadang tim pengembangan menggunakan PPA lain untuk menguji paket tertentu. Rincian ini akan diberitahukan kepada penguji jika perlu

source: Installing from these PPAs means that you will be using and testing packages that developers are currently working with, this means that regressions found by you will not be present once they are released.
id: Menginstal dari PPA ini berarti Anda akan menggunakan dan menguji paket yang saat ini sedang dikerjakan pengembang, ini berarti bahwa regresi yang ditemukan oleh Anda tidak akan hadir setelah dirilis.

source: Removing an in use PPA. Using ppa-purge causes apt to disable a PPA source list and then change affected packages back to the default versions.
id: Menghapus PPA yang digunakan. Menggunakan ppa-purge menyebabkan apt untuk menonaktifkan daftar sumber PPA dan kemudian mengubah paket yang terkena kembali ke versi default.

source: Run <userinput>sudo apt-get install ppa-purge</userinput>
id: Jalankan <input pengguna>sudo apt-get install ppa-purge</input pengguna>

source: Run <userinput>sudo ppa-purge ppa:ppaname</userinput>
id: Jalankan <input pengguna>sudo ppa-purge ppa: nama ppa</input pengguna>

source: Reporting bugs with PPAs can be problematic, please see further information on reporting bugs with PPAs in <xref linkend="qa-bugs-ppa"/>.
id: Melaporkan bug dengan PPA bisa menimbulkan masalah, silakan lihat informasi lebih lanjut tentang pelaporan bug dengan PPA di <xref linkend="qa-bugs-ppa"/>.

source: Static Testing
id: Pengujian Statis

source: Testing the development versions of Xubuntu and packages in it helps keep up the every day quality. If you have spare hardware resources or are able to run a virtualized testing environment, you can help.
id: Menguji versi pengembangan Xubuntu dan paket di dalamnya membantu menjaga kualitas setiap hari. Jika Anda memiliki sumber daya perangkat keras cadangan atau dapat menjalankan lingkungan pengujian tervirtualisasi, Anda dapat membantu.

source: Check the devel mailing list close to the start of the cycle, where the decision as to which testing week(s) we will participate in will be discussed.
id: Periksa milis devel dekat dengan awal siklus, di mana keputusan mengenai minggu pengujian mana yang akan kami ikuti akan dibahas.

source: During testing weeks the ISO will continue to build, the Xubuntu QA Team will watch the tracker reports and make testers aware of issues noted in previous days, notes will be made as appropriate pn the tracker <ulink url="https://dev.xubuntu.org/#tab-qa">QA Status page</ulink>.
id: Selama minggu-minggu pengujian ISO akan terus dibangun, Tim QA Xubuntu akan menonton laporan pelacak dan membuat penguji mengetahui masalah yang dicatat pada hari-hari sebelumnya, catatan akan dibuat sesuai pn pelacak <ulink url="https: // dev. xubuntu.org/#tab-qa"> Halaman Status QA </ulink>.

source: Testing Weeks
id: Pekan Menguji

source: Fixed ISO testing will only take place for the Final Beta, during this milestone it is useful in the 2 days prior to release for the following to have taken place.
id: Pengujian ISO tetap hanya akan berlangsung untuk Final Beta, selama milestone ini berguna dalam 2 hari sebelum rilis untuk hal-hal berikut telah terjadi.

source: Live Session: Boot with the image and ensure that basic application testing (open, close, saving etc.) passes.
id: Sesi Langsung: Boot dengan gambar dan pastikan lolos pengujian aplikasi dasar (buka, tutup, simpan, dll.).

source: Installation tests required pass. These test only the installation.
id: Tes instalasi harus lulus. Ini hanya menguji instalasi.

source: Daily Testing
id: Pengujian harian

source: The importance of daily image testing lies mainly in knowing that boot and/or installation regressions haven’t appeared. Where it appears they have, if you are able to boot with a different flavours image, this can help prove a global or local to Xubuntu issue. If unsure contact the Xubuntu team, preferably on IRC.
id: Pentingnya pengujian gambar harian terutama terletak pada mengetahui bahwa regresi boot dan/atau instalasi belum muncul. Di mana tampaknya mereka miliki, jika Anda dapat boot dengan image rasa yang berbeda, ini dapat membantu membuktikan masalah global atau lokal untuk Xubuntu. Jika tidak yakin, hubungi tim Xubuntu, lebih disukai di IRC.

source: Upgrade Testing
id: Tingkatkan Pengujian

source: About half way through any development cycle (around the beta milestones) we need to test upgrades from the previous release to the new development version. When the development version is intended to be the next LTS release, we need to test both upgrade paths: LTS to LTS and regular to LTS.
id: Sekitar setengah jalan melalui siklus pengembangan (sekitar tonggak beta) kita perlu menguji peningkatan dari rilis sebelumnya ke versi pengembangan baru. Ketika versi pengembangan dimaksudkan untuk menjadi rilis LTS berikutnya, kita perlu menguji kedua jalur peningkatan: LTS ke LTS dan reguler ke LTS.

source: The ISO tracker has a section for upgrade tests which does not change daily, but runs from Friday to Friday. This enables us to test upgrades for a week rather than a day. During these tests it is preferred that the image used for testing is the one built on the first Friday, except where bugs are reported and fixes landed.
id: Pelacak ISO memiliki bagian untuk tes peningkatan yang tidak berubah setiap hari, tetapi beroperasi dari hari Jumat hingga Jumat. Ini memungkinkan kami untuk menguji peningkatan selama seminggu, bukan sehari. Selama pengujian ini, lebih disukai bahwa gambar yang digunakan untuk pengujian adalah yang dibangun pada hari Jumat pertama, kecuali di mana bug dilaporkan dan perbaikan mendarat.

source: Upgrade: tested using the update-manager
id: Peningkatan: diuji menggunakan pembaruan-manajer

source: Upgrade (image): tested using the daily image
id: Pembaruan (gambar): diuji menggunakan gambar harian

source: Package Testing
id: Paket Pengujian

source: For releases where we are making use of the Package Tracker, calls for package testing will be made to the xubuntu-devel mailing list as required. This could be a call from QA or Developers.
id: Untuk rilis di mana kami menggunakan Pelacak Paket, panggilan untuk pengujian paket akan dilakukan ke milis xubuntu-devel sebagaimana diperlukan. Ini bisa berupa panggilan dari QA atau Pengembang.

source: A schedule of planned tests will be mailed to the Xubuntu Devel mailing list close to the cycle start. Reminders of upcoming package test requirements are mailed to the Xubuntu devel mailing list as required. <emphasis>Specific developer testing requirement</emphasis> are mailed as they are available, often these packages will be those found on one of our PPAs.
id: Jadwal tes yang direncanakan akan dikirimkan ke milis Xubuntu Devel dekat dengan permulaan siklus. Pengingat akan persyaratan pengujian paket yang akan datang dikirimkan ke milis Xubuntu devel sesuai kebutuhan. <emphasis> Persyaratan pengujian pengembang khusus </emphasis> dikirimkan saat tersedia, seringkali paket-paket ini akan ditemukan di salah satu PPA kami.

source: Testing Infrastructure
id: Pengujian Infrastruktur

source: Getting ready to test
id: Bersiap untuk menguji

source: To successfully test for Xubuntu, you will need at a minimum 4 things: a Launchpad account, mailing list subscription, an image and something to test it on. This page will give you the basic information in order to do those things and more.
id: Agar berhasil menguji Xubuntu, Anda akan membutuhkan minimal 4 hal: akun Launchpad, langganan milis, gambar dan sesuatu untuk mengujinya. Halaman ini akan memberi Anda informasi dasar untuk melakukan hal-hal itu dan banyak lagi.

source: Contacts
id: Kontak

source: You need a Launchpad account, in order to join the necessary team(s) on it, and log into the 2 QA trackers.
id: Anda memerlukan akun Launchpad, untuk bergabung dengan tim yang diperlukan di dalamnya, dan masuk ke 2 pelacak QA.

source: We use one mailing list to detail what we intend to test during a cycle, we use the same list when we are calling for tests. This list is also used by the team to discuss the development of Xubuntu. You will need to join the Xubuntu Devel <ulink url="https://lists.ubuntu.com/mailman/listinfo/xubuntu-devel">Mailing</ulink> list.
id: Kami menggunakan satu milis untuk merinci apa yang ingin kami uji selama siklus, kami menggunakan daftar yang sama saat kami meminta tes. Daftar ini juga digunakan oleh tim untuk membahas pengembangan Xubuntu. Anda harus bergabung dengan Xubuntu Devel <ulink url="https://lists.ubuntu.com/mailman/listinfo/xubuntu-devel"> Daftar Surat</ulink>.

source: While it is not necessary to do so, we make much use of IRC, so having an account you can use to access the main #xubuntu-devel channel will help you, alternatively you can access the channel via the IRC tab of the Xubuntu <ulink url="http://dev.xubuntu.org/">development</ulink> tracker.
id: Meskipun tidak perlu untuk melakukannya, kami banyak menggunakan IRC, jadi memiliki akun yang dapat Anda gunakan untuk mengakses saluran # xubuntu-devel utama akan membantu Anda, atau Anda dapat mengakses saluran melalui tab IRC pada Xubuntu <ulink url="http://dev.xubuntu.org/"> pengembangan</ulink> pelacak.
